<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Lifia</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="shortcut icon" href="../../imagenes/lifiaicon.ico" >
<style type="text/css">
<!--
@import url("../estilos_lifia.css");
body {
	background-color: #bec2d1;
	margin-left: 0px;
	margin-top: 5px;
	margin-right: 0px;
	margin-bottom: 0px;
	background-image: url();
}
a:link {
	color: #255282;
	text-decoration: none;
}
a:visited {
	text-decoration: none;
	color: #255282;
}
a:hover {
	text-decoration: none;
	color: #FF9933;
}
a:active {
	text-decoration: none;
	color: #FF9933;
}
.Estilo4 {color: #666666}
.Estilo8 {color: #1EA173}
.Estilo9 {color: #333399}
-->
</style>
</head>

<body>
<table width="830" border="0" align="center" cellpadding="0" cellspacing="0" background="../imagenes/line_830.gif">
  <!--DWLayoutTable-->
  <tr>
    <td width="30" rowspan="8" valign="top"><img src="../imagenes/spacer_izq2.gif" width="30" height="615"></td>
    <td colspan="4" valign="top"><table width="780" height="114" border="0" cellpadding="0" cellspacing="0">
        <!--DWLayoutTable-->
        <tr>
          <td width="780" height="170" valign="top"><img src="../imagenes/top_difusion.gif" width="780" height="172" border="0" usemap="#Map"></td>
        </tr>
    </table></td>
  <td width="20" rowspan="8" valign="top"><img src="../imagenes/spacer_der2.gif" width="20" height="485"></td>
  </tr>
  <tr>
    <td width="247" rowspan="5" valign="top"><table width="247" border="0" cellpadding="0" cellspacing="0">
        <!--DWLayoutTable-->
        <tr>
          <td height="19" colspan="3" valign="top"><img src="../imagenes/spacer_vert_19.gif" width="10" height="19"></td>
        </tr>
        <tr>
          <td width="41" rowspan="7" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../index.htm" target="_self">Bienvenida</a></td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../about_us.htm" target="_self">Sobre nosotros</a> </td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../research.htm">Investigaci&oacute;n</a> </td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap><span class="menu_izq"> <a href="../publications.htm" target="_self">Publicaciones </a></span> &#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../technology.htm" target="_self">Transferencia de tec. &amp; servicios </a>&#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" class="menu_izq"><span class="menu_izq Estilo8"> <a href="../capabilities.htm">Capacidades &#13;</a><strong> <a href="capabilities.htm">&#13;&#13;</a></strong></span> &#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top"><a href="../difusion.htm" class="menu_izq"><strong>Difusi&oacute;n</strong></a></td>
        </tr>
        <tr>
          <td height="57">&nbsp;</td>
          <td width="84">&nbsp;</td>
          <td width="122">&nbsp;</td>
        </tr>
        <tr>
          <td height="84" colspan="3" valign="top"><img src="../imagenes/spacer_vert_84.gif" width="10" height="84"></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../sitemap.htm" target="_self">mapa del sitio</a> </div></td>
              <td rowspan="5" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita"><a href="../staff.htm" target="_self">staff</a></div></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../contact.htm" target="_self">contacto</a></div></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../../en/index.htm" target="_self">english version</a> </div></td>
        </tr>
        <tr>
          <td height="16"></td>
          <td></td>
        </tr>
		        <tr>
		          <td>&nbsp;</td>
                  <td>&nbsp;</td>
                  <td>&nbsp;</td>
        </tr>
		
                </table></td>
    <td width="40"></td>
    <td valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
        <td width="107"></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="titulo_principal_cap Estilo9"><span class="titulo_principal_gen">Embedded systems</span><br></td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="titulo_secundario"> (por Nahuel Lofeudo)  - 5/Julio/2007 - <a href="20070705.htm"><strong>Permalink</strong></a> </td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="parrafo_normal"><p><strong> <br></strong>Si alguien nos preguntara cu&aacute;ntas computadoras hay en nuestra casa, la respuesta seguramente ser&iacute;a &ldquo;una&rdquo; para la mayor&iacute;a, &ldquo;dos&rdquo; en el caso de los m&aacute;s afortunados, &ldquo;tres&rdquo; para los muy pocos que tienen mucha plata, o &ldquo;&iquest;De qu&eacute; me est&aacute;s hablando?&rdquo; si la pregunta se la hiciera a mi abuelita.<br>
      La realidad es que todos nosotros estamos rodeados de computadoras que no se ven, y que hacen su trabajo sin molestarnos con cartelitos de error o reinstalaciones, y sin darse a conocer. Son lo que en la jerga se llama &ldquo;embedded systems&rdquo;, que se traduce como &ldquo;sistemas empotrados&rdquo; o &ldquo;sistemas embebidos&rdquo;.</p>
      <p> Entonces&hellip; &iquest;cu&aacute;ntas computadoras hay a nuestro alrededor? Hagamos una lista de las m&aacute;s obvias:<br>
        &iquest;Ten&eacute;s reproductor de MP3? &iexcl;Bingo! Todas las funciones est&aacute;n controladas por software. Los modelos m&aacute;s simples tienen dos CPU: una sencilla y lenta para controlar la interfaz (pantalla y botones), y otra m&aacute;s r&aacute;pida para hacer la codificaci&oacute;n y decodificaci&oacute;n del audio y manejar la comunicaci&oacute;n con la PC.<br>
        &iquest;Reproductor de DVD? Los m&aacute;s simples usan procesadores especializados en decodificar el formato MPEG2, y los m&aacute;s complejos tienen verdaderas computadoras con su propio sistema operativo, placas de red, USB y la mar en coche.</p>
      <p> &iquest;Televisor? Salvo los modelos m&aacute;s sencillos, todos tienen una CPU que recibe las &oacute;rdenes del control remoto y comanda todos los sistemas internos.</p>
      <p> De los celulares no vamos a hablar porque ya son un caso aparte. Los m&aacute;s sofisticados son verdaderas computadoras port&aacute;tiles y seguramente van a seguir evolucionando en los pr&oacute;ximos a&ntilde;os. Lo mismo va para las PDAs (Palm, PocketPC o Smartphones varios).</p>
      <p> Y las no tan obvias&hellip;</p>
      <p> &iquest;Ten&eacute;s un microondas digital? &iquest;Radio-reloj? &iquest;Calculadora? &iquest;Aire acondicionado? &iquest;Videocassettera? &iquest;Reloj digital? &iquest;Alarma en el auto o en la casa? &iquest;Sistema minicomponente? &iquest;Tom&aacute;s el micro y le pag&aacute;s a la maqui?</p>
      <p> TODOS ellos est&aacute;n controlados por sistemas inform&aacute;ticos.</p>
      <p> Si contaste cada una de las veces en las que dijiste &ldquo;s&iacute;&rdquo;, seguramente vas a tener alrededor de 10 cosas controladas por computadora en tu casa o alrededor tuyo. Mir&aacute; bien: est&aacute;n por todos lados.<br>
        Pero &iquest;qu&eacute; son estas computadoras? Obviamente no son PCs. Son procesadores mucho m&aacute;s chicos que una PC, en prestaciones y en tama&ntilde;o. Est&aacute;n hechos para integrarse con los aparatos que controlan, y sobre todo para ser muy baratos.</p>
      <p> Se&ntilde;oras y se&ntilde;ores, les presento a&hellip;. el microcontrolador.</p>
    
      <p align="center"><img src="20070705/foto_uno.png" alt="microcontrolador" width="298" height="298"></p>
      <p align="center"><img src="20070705/foto_dos.png" width="297" height="180"></p>
      <p> De afuera no parece gran cosa, s&oacute;lo otra cucarachita negra, a veces cuadrada a veces rectangular, llena de patas. Lo importante, como dec&iacute;a la propaganda del Tofi, es lo que lleva dentro.</p>
      <p> <strong>El hardware</strong><br>
        <br>
Y lo que lleva dentro es una computadora completa. Si se&ntilde;ores: CPU, memorias, puertos de comunicaciones, relojes e incluso transmisores/receptores de radio son algunos de los perif&eacute;ricos que estas verdaderas maravillas de la electr&oacute;nica llevan en sus entra&ntilde;as.</p>
      <p> Las diferencias entre un microcontrolador y una computadora com&uacute;n son pocas. Una de las fundamentales es la forma en que manejan la memoria.</p>
      <p> Como son sistemas que tienen que sobrevivir a cortes de energ&iacute;a (que los desenchufen o les saquen las pilas, por ejemplo) no pueden tener el software guardado en memoria RAM as&iacute; que tienen uno o m&aacute;s bancos de memoria Flash, que son regrabables y retienen el contenido a&uacute;n sin alimentaci&oacute;n (para que sirva de comparaci&oacute;n, la memoria flash es la misma que usan los pen-drives o reproductores de MP3 para guardar archivos, a&uacute;n cuando no tienen pilas).</p>
      <p> Por otro lado ser&iacute;a una locura guardar las variables y el estado del programa en la misma memoria que es lent&iacute;sima a la hora de escribir, as&iacute; que tienen que tener un pu&ntilde;ado de bytes de RAM para todos los datos din&aacute;micos.</p>
      <p> Esto hace que haya dentro del chip como m&iacute;nimo dos bancos de memoria completamente distinta (vol&aacute;til vs. no vol&aacute;til, r&aacute;pida vs. lenta) y ser&iacute;a muy complejo manejar ambos tipos de memoria como una sola, por lo que se usa una arquitectura distinta a la de las computadoras m&aacute;s grandes. Esta arquitectura, donde distintos tipos de memoria tienen diferentes usos, se llama Arquitectura Harvard:</p>
      <p align="center"><img src="20070705/foto_tres.png" width="324" height="236"></p>
     
    
      <p> Otra de las diferencias fundamentales, que tambi&eacute;n se da en el caso de las PDAs y celulares, es que los programas se desarrollan en una PC de escritorio y luego en la PC se genera el c&oacute;digo ejecutable para el microcontrolador en cuesti&oacute;n (a este proceso se le llama compilaci&oacute;n cruzada). Por las limitaciones de espacio y velocidad, se trata de usar lenguajes lo m&aacute;s livianos posibles, como C o dialectos muy simplificados de Java usando compiladores especiales.</p>
      <p> &iquest;Y a qu&eacute; viene todo esto?</p>
      <p> En el grupo de Context-Aware del Lifia estamos trabajando con microcontroladores para crear software que pueda reaccionar a su entorno, sensando su posici&oacute;n en el espacio y actuando en consecuencia.</p>
      <p> Estamos usando un modelo de microcontrolador que tiene incorporado un &ldquo;modem wireless&rdquo; que le permite enviar y recibir informaci&oacute;n por radio, y sensar su ubicaci&oacute;n.</p>
      <p align="center"><img src="20070705/foto_cuatro.gif" width="340" height="374"> </p>
	   <p align="center"><img src="20070705/foto_cinco.gif" width="341" height="232"></p>
        <p> Nuestra idea es utilizar estos microcontroladores para formar &ldquo;placas de red inteligentes&rdquo; para PDAs y localizadores aut&oacute;nomos, que formen una red inal&aacute;mbrica propia para que todos los integrantes de la red puedan intercambiar informaci&oacute;n y saber su posici&oacute;n actual.</p>
        <p>Seguimos la pr&oacute;xima&hellip;</p>
        <span class="parrafo_normal">      </span></td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td width="386">&nbsp;</td>
    <td></td>
  </tr>
  <tr>
    <td colspan="2" valign="top"><div align="left">
            <p>&nbsp;</p>
            <p><a href="../feed.xml" target="_blank">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img border=0 src="../imagenes/rss.png"></a></p>
          </div></td>
    <td>&nbsp;</td>
    <td>&nbsp;</td>
    <td></td>
  </tr>
  <tr>
    <td colspan="4" valign="top" class="menu_pie"><a href="about_us.htm" target="_self"> sobre nosotros</a> <span class="secciones">| <a href="research.htm" target="_self">investigaci&oacute;n</a> |</span> <a href="publications.htm" target="_self">publicaciones</a> <span class="secciones">|</span> <a href="technology.htm" target="_self">transferencia de t.</a> <span class="secciones">|</span> <a href="capabilities.htm" target="_self">capacidades</a> </td>
  </tr>
  <tr>
    <td colspan="6" valign="bottom" nowrap><img src="../imagenes/barra_down.gif" width="830" height="43" border="0" usemap="#Map"></td>
  </tr>
</table>
<map name="Map">
  <area shape="rect" coords="609,-31,743,22" href="http://www.amplioespectro.com" target="_blank">
</map>
</body>
</html>

<!-- Localized -->