<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Lifia</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="shortcut icon" href="../../imagenes/lifiaicon.ico" >
<style type="text/css">
<!--
@import url("../estilos_lifia.css");
body {
	background-color: #bec2d1;
	margin-left: 0px;
	margin-top: 5px;
	margin-right: 0px;
	margin-bottom: 0px;
	background-image: url();
}
a:link {
	color: #255282;
	text-decoration: none;
}
a:visited {
	text-decoration: none;
	color: #255282;
}
a:hover {
	text-decoration: none;
	color: #FF9933;
}
a:active {
	text-decoration: none;
	color: #FF9933;
}
.Estilo4 {color: #666666}
.Estilo8 {color: #1EA173}
.Estilo9 {color: #333399}

.centro{FONT-SIZE: 13px; COLOR: #666666; font-weight:bold;FONT-FAMILY: "Trebuchet MS", Verdana;
text-align:center;}
.linkTexto {
		COLOR: #0033CC; 	text-decoration:underline;
		font-weight:bold;}
-->
</style>
</head>

<body>
<script type="text/javascript" src="wz_tooltip.js"></script>
<table width="830" border="0" align="center" cellpadding="0" cellspacing="0" background="../imagenes/line_830.gif">
  <!--DWLayoutTable-->
  <tr>
    <td width="30" rowspan="8" valign="top"><img src="../imagenes/spacer_izq2.gif" width="30" height="615"></td>
    <td colspan="4" valign="top"><table width="780" height="114" border="0" cellpadding="0" cellspacing="0">
        <!--DWLayoutTable-->
        <tr>
          <td width="780" height="170" valign="top"><img src="../imagenes/top_difusion.gif" width="780" height="172" border="0" usemap="#Map"></td>
        </tr>
    </table></td>
  <td width="20" rowspan="8" valign="top"><img src="../imagenes/spacer_der2.gif" width="20" height="485"></td>
  </tr>
  <tr>
    <td width="247" rowspan="5" valign="top"><table width="247" border="0" cellpadding="0" cellspacing="0">
        <!--DWLayoutTable-->
        <tr>
          <td height="19" colspan="3" valign="top"><img src="../imagenes/spacer_vert_19.gif" width="10" height="19"></td>
        </tr>
        <tr>
          <td width="41" rowspan="7" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../index.htm" target="_self">Bienvenida</a></td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../about_us.htm" target="_self">Sobre nosotros</a> </td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../research.htm">Investigaci&oacute;n</a> </td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap><span class="menu_izq"> <a href="../publications.htm" target="_self">Publicaciones </a></span> &#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../technology.htm" target="_self">Transferencia de tec. &amp; servicios </a>&#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" class="menu_izq"><span class="menu_izq Estilo8"> <a href="../capabilities.htm">Capacidades &#13;</a><strong> <a href="capabilities.htm">&#13;&#13;</a></strong></span> &#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top"><a href="../difusion.htm" class="menu_izq"><strong>Difusi&oacute;n</strong></a></td>
        </tr>
        <tr>
          <td height="57">&nbsp;</td>
          <td width="84">&nbsp;</td>
          <td width="122">&nbsp;</td>
        </tr>
        <tr>
          <td height="84" colspan="3" valign="top"><img src="../imagenes/spacer_vert_84.gif" width="10" height="84"></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../sitemap.htm" target="_self">mapa del sitio</a> </div></td>
              <td rowspan="5" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita"><a href="../staff.htm" target="_self">staff</a></div></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../contact.htm" target="_self">contacto</a></div></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../../en/index.htm" target="_self">english version</a> </div></td>
        </tr>
        <tr>
          <td height="16"></td>
          <td></td>
        </tr>
		        <tr>
		          <td>&nbsp;</td>
                  <td>&nbsp;</td>
                  <td>&nbsp;</td>
        </tr>
		
                </table></td>
    <td width="40"></td>
    <td valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
        <td width="107"></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="titulo_principal_cap Estilo9">Compilación Distribuida</td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="titulo_secundario"> (por Abel Valente) -  29/Noviembre/2007 - <a href="20071128.htm"><strong>Permalink</strong></a> </td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="parrafo_normal">          <P class=contenidos>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;  Ya desde los primeros meses del proyecto &quot;casino&quot; los juegos fueron algo lento de compilar. Testear un cambio hecho en las librer&iacute;as de base requiere aproximadamente 40min de compilaci&oacute;n de librer&iacute;as y binarios. En total son alrededor de 30 proyectos C++ (libs, dlls y exes) con varias dependencias entre ellos. Esto se vuelve un infierno si estas trabajando en alguna capa de base de los juegos. Si uno quiere un juego completo con todas las componentes que salen de nuestra herramienta de build actual, entonces el tiempo sube a 1:30-2:00 horas.<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; El proceso de construcci&oacute;n ha variado mucho desde los comienzos hasta la actualidad. Por empezar fuimos variando la versi&oacute;n del compilador de C++, habiendo pasado por varios de Microsoft y ahora una combinaci&oacute;n de Intel C++ Compiler y Microsoft Visual C++. El compilador se utiliza para compilar tanto proyectos de Visual Studio como makefiles de librar&iacute;as third-party. Luego de tener los binarios se utilizan algunos de estos para continuar la construcci&oacute;n. Ejecutamos un compilador de recursos que optimiza y prepara el set de gr&aacute;fica y sonidos que utilizar&aacute; el juego. Tambi&eacute;n corremos una herramienta que analiza las probabilidades de pago del juego construido y genera documentaci&oacute;n en latex al respecto. Finalmente el compilador de latex procesa esta salida y tambi&eacute;n algunos documentos m&aacute;s que van con el juego, como el que se le da a un usuario. Adem&aacute;s, una de las cosas que siempre tuvimos que mantener es la compilaci&oacute;n completa y desde cero de los juegos. En C++ hay muchos errores que se pueden generar por equivocaciones en el proceso de build, sobre todo si se hace a mano y que no se detectan. Estos aparecen en runtime con excepciones de memoria corrupta y se deben por ejemplo, a un header viejo o un librer&iacute;a no actualizada. Para nosotros construir un juego desde cero es requisito si se quiere correr cualquier test con un m&iacute;nimo de seriedad.<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Como consecuencia de todo esto, uno se pregunta qu&eacute; chances hay de acelerar el proceso de build de los juegos, y la primera idea que se nos vino a la cabeza es hacer compilaci&oacute;n distribuida. Se podr&iacute;a tomar ventaja de la paralelizaci&oacute;n de la compilaci&oacute;n usando varias m&aacute;quinas? Buscando un poco en internet descubrimos que no era una idea nueva, y como suele pasar, ya estaba hecha. El software que usamos actualmente aprovecha la potencia de c&oacute;mputo de las m&aacute;quinas idle de la red para ayudar con la compilaci&oacute;n C++. Para las m&aacute;quinas m&aacute;s nuevas multi-procesador tambi&eacute;n es posible lanzar un proceso de compilaci&oacute;n en cada uno (en el caso de que el compilador no sepa aprovechar los multiples procesadores por si solo). Las empresas que hacen este tipo de software dicen que en una sesi&oacute;n laboral est&aacute;ndar de un programador se usa solamente el 5% del poder de procesamiento diario y esto parece ser al menos aproximado a nuestro caso.<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ajustando el servicio de compilaci&oacute;n a nuestras necesidades se puede lograr un entorno de compilaci&oacute;n muy c&oacute;modo. Es posible ajustar la prioridad de los procesos de compilaci&oacute;n de ciertas m&aacute;quinas para que sus builds tengan m&aacute;s prioridad que el resto (p.ej servidores de build). Tambi&eacute;n es posible ajustar la elegibilidad de ciertas m&aacute;quinas para que sean m&aacute;s elegidas para colaborar con los builds (caso de m&aacute;quinas r&aacute;pidas). Y tambi&eacute;n es posible ajustar el umbral desde el cual una m&aacute;quina es considerada disponible para compilar. En el caso de las m&aacute;quinas de desarrollo es cuando est&aacute;n idles, con uso de procesador muy bajo. Cuando el &iacute;ndice de uso de la red de compilaci&oacute;n es bajo tambi&eacute;n se suele lanzar una misma compilaci&oacute;n en m&aacute;s de una m&aacute;quina y se utiliza la que termine primero.<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Con este sistema, los tiempos de compilaci&oacute;n se redujeron dr&aacute;sticamente en nuestro escenario de 30 m&aacute;quinas disponibles, sin embargo esto optimiz&oacute; solo la parte de C++. A&uacute;n nos queda mucho por optimizar de nuestro proceso de build en nuetras herramientas propietarias. A priori, lo primero que hicimos fue aprovechar los nuevos procesadores multi-core para paralelizar algunos de nuestros pasos en herramientas que no pod&iacute;an utilizarlos nativamente. Esto se pudo hacer s&oacute;lo cuando el proceso en cuesti&oacute;n no es muy dependiente de I/O ya que de otra forma se ven resultados negativos. Por ejemplo, paralelizamos la compilaci&oacute;n de los documentos con latex lanzando un compilador en cada procesador y con esto multiplicamos la velocidad de compilaci&oacute;n por un &iacute;ndice muy alto, casi equivalente al n&uacute;mero de cores de la m&aacute;quina. No nos fue tan bien cuando probamos hacer esto con nuestro compilador de recursos, el resultado fue un exceso de I/O y un enlentecimiento general.<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Los resultados son m&aacute;s que satisfactorios. Los juegos pasan de compilarse en 1:30 horas a compilarse en 17 minutos. Este &iacute;ndice de mejor&iacute;a deja claro que para nosotros la compilaci&oacute;n distribuida y paralela es una herramienta casi escencial, al menos si queremos mantener la productividad a la que estamos acostumbrados.</P>
    </td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td width="386">&nbsp;</td>
    <td></td>
  </tr>
  <tr>
    <td colspan="2" valign="top"><div align="left">
            <p>&nbsp;</p>
            <p><a href="../feed.xml" target="_blank">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img border=0 src="../imagenes/rss.png"></a></p>
          </div></td>
    <td>&nbsp;</td>
    <td>&nbsp;</td>
    <td></td>
  </tr>
  <tr>
    <td colspan="4" valign="top" class="menu_pie"><a href="about_us.htm" target="_self"> sobre nosotros</a> <span class="secciones">| <a href="research.htm" target="_self">investigaci&oacute;n</a> |</span> <a href="publications.htm" target="_self">publicaciones</a> <span class="secciones">|</span> <a href="technology.htm" target="_self">transferencia de t.</a> <span class="secciones">|</span> <a href="capabilities.htm" target="_self">capacidades</a> </td>
  </tr>
  <tr>
    <td colspan="6" valign="bottom" nowrap><img src="../imagenes/barra_down.gif" width="830" height="43" border="0" usemap="#Map"></td>
  </tr>
</table>
<map name="Map">
  <area shape="rect" coords="609,-31,743,22" href="http://www.amplioespectro.com" target="_blank">
</map>
</body>
</html>

<!-- Localized -->