<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Lifia</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="shortcut icon" href="../../imagenes/lifiaicon.ico" >
<style type="text/css">
<!--
@import url("../estilos_lifia.css");
body {
	background-color: #bec2d1;
	margin-left: 0px;
	margin-top: 5px;
	margin-right: 0px;
	margin-bottom: 0px;
	background-image: url();
}
a:link {
	color: #255282;
	text-decoration: none;
}
a:visited {
	text-decoration: none;
	color: #255282;
}
a:hover {
	text-decoration: none;
	color: #FF9933;
}
a:active {
	text-decoration: none;
	color: #FF9933;
}
.Estilo4 {color: #666666}
.Estilo8 {color: #1EA173}
.Estilo9 {color: #333399}

.centro{FONT-SIZE: 13px; COLOR: #666666; font-weight:bold;FONT-FAMILY: "Trebuchet MS", Verdana;
text-align:center;}
.linkTexto {
		COLOR: #0033CC; 	text-decoration:underline;
		font-weight:bold;}
-->
</style>
</head>

<body>
<script type="text/javascript" src="wz_tooltip.js"></script>
<table width="830" border="0" align="center" cellpadding="0" cellspacing="0" background="../imagenes/line_830.gif">
  <!--DWLayoutTable-->
  <tr>
    <td width="30" rowspan="8" valign="top"><img src="../imagenes/spacer_izq2.gif" width="30" height="615"></td>
    <td colspan="4" valign="top"><table width="780" height="114" border="0" cellpadding="0" cellspacing="0">
        <!--DWLayoutTable-->
        <tr>
          <td width="780" height="170" valign="top"><img src="../imagenes/top_difusion.gif" width="780" height="172" border="0" usemap="#Map"></td>
        </tr>
    </table></td>
  <td width="20" rowspan="8" valign="top"><img src="../imagenes/spacer_der2.gif" width="20" height="485"></td>
  </tr>
  <tr>
    <td width="247" rowspan="5" valign="top"><table width="247" border="0" cellpadding="0" cellspacing="0">
        <!--DWLayoutTable-->
        <tr>
          <td height="19" colspan="3" valign="top"><img src="../imagenes/spacer_vert_19.gif" width="10" height="19"></td>
        </tr>
        <tr>
          <td width="41" rowspan="7" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../index.htm" target="_self">Bienvenida</a></td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../about_us.htm" target="_self">Sobre nosotros</a> </td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../research.htm">Investigaci&oacute;n</a> </td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap><span class="menu_izq"> <a href="../publications.htm" target="_self">Publicaciones </a></span> &#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../technology.htm" target="_self">Transferencia de tec. &amp; servicios </a>&#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" class="menu_izq"><span class="menu_izq Estilo8"> <a href="../capabilities.htm">Capacidades &#13;</a><strong> <a href="capabilities.htm">&#13;&#13;</a></strong></span> &#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top"><a href="../difusion.htm" class="menu_izq"><strong>Difusi&oacute;n</strong></a></td>
        </tr>
        <tr>
          <td height="57">&nbsp;</td>
          <td width="84">&nbsp;</td>
          <td width="122">&nbsp;</td>
        </tr>
        <tr>
          <td height="84" colspan="3" valign="top"><img src="../imagenes/spacer_vert_84.gif" width="10" height="84"></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../sitemap.htm" target="_self">mapa del sitio</a> </div></td>
              <td rowspan="5" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita"><a href="../staff.htm" target="_self">staff</a></div></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../contact.htm" target="_self">contacto</a></div></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../../en/index.htm" target="_self">english version</a> </div></td>
        </tr>
        <tr>
          <td height="16"></td>
          <td></td>
        </tr>
		        <tr>
		          <td>&nbsp;</td>
                  <td>&nbsp;</td>
                  <td>&nbsp;</td>
        </tr>
		
                </table></td>
    <td width="40"></td>
    <td valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
        <td width="107"></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="titulo_principal_cap Estilo9">&iquest;C&oacute;mo la tecnolog&iacute;a puede facilitar un medio ambiente sostenible?</td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="titulo_secundario"><span class="contenidos_titulos">(por Ricardo Tesoriero) </span>  - 10/Junio/2008 - <a href="20080610.htm"><strong>Permalink</strong></a> </td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="parrafo_normal">
              <P class=contenidos>
								 	  &nbsp;&nbsp;&nbsp; Mi nombre es Ricardo Tesoriero, entr&eacute; en el LIFIA a mediados del '99 y estuve involucrado en CSCW con gente como el Casco, Fede Naso, Fernando Garc&iacute;a, Diego de Sogos, Leandro Quiroga y Diego Torres. En el 2003 comenc&eacute; mi experiencia en Casinos hasta el 2005. Luego decid&iacute; irme a la Universidad de Castilla-La Mancha (en Albacete, Espa&ntilde;a) a hacer un doctorado (que espero terminar a fin de a&ntilde;o o principios del que viene).<br>
								 	  <br>
 							               &nbsp;&nbsp;&nbsp; Aqu&iacute; comenc&eacute; a trabajar con meta-modelos en sensibilidad al contexto y computaci&oacute;n ubicua. Como soy de los que les gusta la teor&iacute;a, pero tambi&eacute;n la pr&aacute;ctica, comenzamos a experimentar con computaci&oacute;n m&oacute;vil y una tecnolog&iacute;a que est&aacute; pasando de un ambiente industrial a uno m&aacute;s cotidiano de forma paulatina pero constante que es RFID.<br>
 							               <br>
 							               &nbsp;&nbsp;&nbsp; Esta tecnolog&iacute;a permite identificar etiquetas por medio de un lector. Dependiendo del tipo de etiqueta y lector las distancias de lectura var&iacute;an. Las etiquetas pasivas (no requieren alimentaci&oacute;n externa) se pueden leer, con un lector Compact Flash para PDA, desde una distancia m&aacute;xima aproximada de 10 cm. En tanto que las activas (que necesitan alimentaci&oacute;n externa) a 10 o 20 metros.<br>
 							               <br>
 							               &nbsp;&nbsp;&nbsp; Al principio, aplicamos esta tecnolog&iacute;a a las Gu&iacute;as Muse&iacute;sticas Inal&aacute;mbricas Inteligentes para la obtenci&oacute;n autom&aacute;tica de informaci&oacute;n a partir de la posici&oacute;n del usuario. Los prototipos fueron llevados a cabo en tecnolog&iacute;a .NET y uno de los participantes del proyecto fue Ram&oacute;n Tebar, entusiasta y entendido de la tecnolog&iacute;a.<br>
 							               <br>
 							               &nbsp;&nbsp;&nbsp; La idea surgi&oacute; por parte de Ram&oacute;n quien es uno de los alumnos a los cuales le co-dirijo, junto con Jos&eacute; Antonio Gallud, el Proyecto de Fin de Carrera. Ram&oacute;n quer&iacute;a participar en el concurso Imagine Cup que organiza Microsoft todos los a&ntilde;os. El tema era &quot;Como la tecnolog&iacute;a puede facilitar un medio ambiente sostenible&quot;.<br>
 							               <br>
 							               &nbsp;&nbsp;&nbsp; Ram&oacute;n estaba trabajando con nosotros en la continuaci&oacute;n de GUIMUININ (Gu&iacute;as Muse&iacute;sticas Inal&aacute;mbricas Inteligentes). La idea era a&ntilde;adirle caracter&iacute;sticas de location-aware a una gu&iacute;a ya en producci&oacute;n en el MCA (Museo de la Cuchiller&iacute;a de Albacete). El sistema b&aacute;sicamente se val&iacute;a de unas PDAs con conexi&oacute;n WiFi que mostraban informaci&oacute;n sobre las piezas expuestas en museos o galer&iacute;as de arte. La funci&oacute;n del location-aware era evitar que el usuario tenga que seleccionar las piezas con el l&aacute;piz de la PDA y reemplazar ese tipo de interacci&oacute;n con gestos o ubicaci&oacute;n del usuario. Para el location-aware utilizamos etiquetas RFID a dos niveles activas (coarse grained spaces o sea salas y pasillos) y pasivas (fine grained spaces o sea vitrinas y piezas). Finalmente obtuvimos un prototipo que funcionaba tanto con activas como con pasivas, pero como los lectores eran diferentes, no se pod&iacute;an meter en una sola PDA y s&oacute;lo se pod&iacute;a usar un sistema o el otro (aunque el sistema soportaba casi cualquier m&eacute;todo de localizaci&oacute;n).<br>
 							               <br>
 							               &nbsp;&nbsp;&nbsp; Entonces decidimos tomar las etiquetas pasivas y b&aacute;sicamente, en vez de buscar informaci&oacute;n relacionada con un objeto de arte, decidimos hacerlo sobre paneles de informaci&oacute;n ecol&oacute;gicos. El desaf&iacute;o era conseguir una aplicaci&oacute;n sensible al contexto (que sirva para n paneles) que nos permitiera en principio recuperar informaci&oacute;n ecol&oacute;gica sobre ellos (fotos, audios, videos, audio-textos, etc.).<br>
 							               <br>
&nbsp;&nbsp;&nbsp; 							               La idea era prometedora porque el tema de WiFi metropolitana est&aacute; en auge y nosotros us&aacute;bamos un servicio web para traer la informaci&oacute;n de los paneles lo que da un potencial de negocio bastante importante.<br>
<br>
 							               &nbsp;&nbsp;&nbsp; Pero no nos conform&aacute;bamos con eso, as&iacute; que incluimos algo de colaboraci&oacute;n y lo que propusimos, y de hecho hicimos, fue incorporar algo que ahora est&aacute; bastante de moda que es el Social Software. O sea incorporamos herramientas como un Blog, un RSS, herramientas de Voto, etc. para fomentar la participaci&oacute;n de la ciudadan&iacute;a en cuestiones ecol&oacute;gicas. En pocas palabras lo que hicimos fue combinar la facilidad de interacci&oacute;n que da la tecnolog&iacute;a RFID (obtener datos de una etiqueta acercando un lector) con los espacios p&uacute;blicos y llevar las capacidades de las herramientas de social software de internet a espacios f&iacute;sicos.<br>
 							               <br>
&nbsp;&nbsp;&nbsp; 							               El evento fue en la Madrid, llegaron 5 equipos de toda Espa&ntilde;a y quedamos segundos. Fue una buena experiencia y el premio fue una XBOX (ya est&aacute; recibiendo mi hermano :) ).<br>
<br>
 							               &nbsp;&nbsp;&nbsp; Lamentablemente esto no cuenta para conseguir plazas en la universidad :( aunque como an&eacute;cdota podemos decir que tuvimos que implementarlo en 1 semana porque no ten&iacute;amos esperanzas de que fuera aceptada la propuesta. Y lo bueno de todo esto fue recordar los viejos tiempos de programar hasta las 2, 3 o 5 de ma&ntilde;ana durante d&iacute;as para tener el sistema a tiempo :P.<br>
 							               <br>
 							               &nbsp;&nbsp;&nbsp; En fin, me quedo con una frase de Forrest Gump &quot;La vida es como una caja de chocolates, nunca sab&eacute;s con lo que te pod&eacute;s encontrar&quot; para explicar la iron&iacute;a del destino de un fiel servidor a la causa Java (y que actualmente dicta cursos de JEE 5) pero que participa en concursos de la competencia en .NET tambi&eacute;n.<br>
 							               <br>
 							               <strong>Material de referencia</strong><br>
 							             Presentaci&oacute;n en youtube:<br>
 							             <a href="http://www.youtube.com/v/frVsuPfWK70&hl=es"><span class="linkTexto">http://www.youtube.com/v/frVsuPfWK70&amp;hl=es</span></a><br>
 							             <a href="http://www.youtube.com/v/0wgrXSKqWrE&hl=es"><span class="linkTexto">http://www.youtube.com/v/0wgrXSKqWrE&amp;hl=es</span></a><br>
 							             <a href="http://www.youtube.com/v/3Bol57UQMzQ&hl=es"><span class="linkTexto">http://www.youtube.com/v/3Bol57UQMzQ&amp;hl=es</span></a><br>
					                     <br>
					                     <strong>					                     Blog del proyecto:</strong><br>
				                         <a href="http://labloguera.net/blogs/ier/default.aspx"><span class="linkTexto"> http://labloguera.net/blogs/ier/default.aspx</span></a></P> 	
    </td>
<td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td width="386"></td>
    <td></td>
  </tr>
  <tr>
    <td colspan="2" valign="top"><div align="left">
            <p>&nbsp;</p>
            <p><a href="../feed.xml" target="_blank">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img border=0 src="../imagenes/rss.png"></a></p>
          </div></td>
    <td>&nbsp;</td>
    <td>&nbsp;</td>
    <td></td>
  </tr>
  <tr>
    <td colspan="4" valign="top" class="menu_pie"><a href="about_us.htm" target="_self"> sobre nosotros</a> <span class="secciones">| <a href="research.htm" target="_self">investigaci&oacute;n</a> |</span> <a href="publications.htm" target="_self">publicaciones</a> <span class="secciones">|</span> <a href="technology.htm" target="_self">transferencia de t.</a> <span class="secciones">|</span> <a href="capabilities.htm" target="_self">capacidades</a> </td>
  </tr>
  <tr>
    <td colspan="6" valign="bottom" nowrap><img src="../imagenes/barra_down.gif" width="830" height="43" border="0" usemap="#Map"></td>
  </tr>
</table>
<map name="Map">
  <area shape="rect" coords="609,-31,743,22" href="http://www.amplioespectro.com" target="_blank">
</map>
</body>
</html>

<!-- Localized -->