<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Lifia</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="shortcut icon" href="../../imagenes/lifiaicon.ico" >
<style type="text/css">
<!--
@import url("../estilos_lifia.css");
body {
	background-color: #bec2d1;
	margin-left: 0px;
	margin-top: 5px;
	margin-right: 0px;
	margin-bottom: 0px;
	background-image: url();
}
a:link {
	color: #255282;
	text-decoration: none;
}
a:visited {
	text-decoration: none;
	color: #255282;
}
a:hover {
	text-decoration: none;
	color: #FF9933;
}
a:active {
	text-decoration: none;
	color: #FF9933;
}
.Estilo4 {color: #666666}
.Estilo8 {color: #1EA173}
.Estilo9 {color: #333399}

.centro{FONT-SIZE: 13px; COLOR: #666666; font-weight:bold;FONT-FAMILY: "Trebuchet MS", Verdana;
text-align:center;}
.linkTexto {
		COLOR: #0033CC; 	text-decoration:underline;
		font-weight:bold;}
-->
</style>
</head>

<body>
<script type="text/javascript" src="wz_tooltip.js"></script>
<table width="830" border="0" align="center" cellpadding="0" cellspacing="0" background="../imagenes/line_830.gif">
  <!--DWLayoutTable-->
  <tr>
    <td width="30" rowspan="8" valign="top"><img src="../imagenes/spacer_izq2.gif" width="30" height="615"></td>
    <td colspan="4" valign="top"><table width="780" height="114" border="0" cellpadding="0" cellspacing="0">
        <!--DWLayoutTable-->
        <tr>
          <td width="780" height="170" valign="top"><img src="../imagenes/top_difusion.gif" width="780" height="172" border="0" usemap="#Map"></td>
        </tr>
    </table></td>
  <td width="20" rowspan="8" valign="top"><img src="../imagenes/spacer_der2.gif" width="20" height="485"></td>
  </tr>
  <tr>
    <td width="247" rowspan="5" valign="top"><table width="247" border="0" cellpadding="0" cellspacing="0">
        <!--DWLayoutTable-->
        <tr>
          <td height="19" colspan="3" valign="top"><img src="../imagenes/spacer_vert_19.gif" width="10" height="19"></td>
        </tr>
        <tr>
          <td width="41" rowspan="7" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../index.htm" target="_self">Bienvenida</a></td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../about_us.htm" target="_self">Sobre nosotros</a> </td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../research.htm">Investigaci&oacute;n</a> </td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap><span class="menu_izq"> <a href="../publications.htm" target="_self">Publicaciones </a></span> &#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../technology.htm" target="_self">Transferencia de tec. &amp; servicios </a>&#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" class="menu_izq"><span class="menu_izq Estilo8"> <a href="../capabilities.htm">Capacidades &#13;</a><strong> <a href="capabilities.htm">&#13;&#13;</a></strong></span> &#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top"><a href="../difusion.htm" class="menu_izq"><strong>Difusi&oacute;n</strong></a></td>
        </tr>
        <tr>
          <td height="57">&nbsp;</td>
          <td width="84">&nbsp;</td>
          <td width="122">&nbsp;</td>
        </tr>
        <tr>
          <td height="84" colspan="3" valign="top"><img src="../imagenes/spacer_vert_84.gif" width="10" height="84"></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../sitemap.htm" target="_self">mapa del sitio</a> </div></td>
              <td rowspan="5" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita"><a href="../staff.htm" target="_self">staff</a></div></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../contact.htm" target="_self">contacto</a></div></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../../en/index.htm" target="_self">english version</a> </div></td>
        </tr>
        <tr>
          <td height="16"></td>
          <td></td>
        </tr>
		        <tr>
		          <td>&nbsp;</td>
                  <td>&nbsp;</td>
                  <td>&nbsp;</td>
        </tr>
		
                </table></td>
    <td width="40"></td>
    <td valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
        <td width="107"></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="titulo_principal_cap Estilo9"><span class="contenidos_titulos">Proyecto Wii Remote</span></td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="titulo_secundario"><span class="contenidos_titulos">(por Laureano Bulus)</span>  - 04/Septiembre/2008 - <a href="20080904.htm"><strong>Permalink</strong></a> </td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="parrafo_normal">
   <P class=contenidos>
										 
  &nbsp;  &nbsp;  &nbsp;  Desde su lanzamiento a fines de 2006 en los mercados m&aacute;s importantes del mundo, Wii ha revolucionado el mundo de los video juegos. Es la &uacute;ltima consola de Nintendo que ha salido al campo de batalla para luchar contra sus archienemigos PlayStation 3 y XBOX 360, empleando caracter&iacute;sticas distintivas como son su reducido tama&ntilde;o y amplia posibilidad de interconexi&oacute;n (USB, BlueTooth y WiFi) y llevando al frente su estandarte: el novedoso Control Remoto Wii (Wii Remote o com&uacute;nmente Wiimote). El Wiimote tiene la capacidad de percibir su propio movimiento gracias a los aceler&oacute;metros que posee en su interior. Para ser m&aacute;s espec&iacute;fico, lo que puede hacer es estimar la aceleraci&oacute;n presente en cada uno de los tres ejes espaciales, lo que le permite calcular la rapidez, la direcci&oacute;n y el sentido del movimiento. Para completar esta percepci&oacute;n posee un sensor de luz infrarroja que capta la luz emitida por una barra de LEDs y emplea esta se&ntilde;al para calcular la distancia entre el control remoto y dicha barra. El uso de este sensor, no s&oacute;lo le da la posibilidad de calcular su posici&oacute;n, si no tambi&eacute;n de seguir los movimientos lentos que pueda realizar el control.
						              <P class=contenidos>&nbsp;  &nbsp;  &nbsp; Este aparatito ha despertado el inter&eacute;s de gente que desarroll&oacute; aplicaciones para utilizar el Wiimote con una computadora, como GlovePie o WiinRemote, y de personas como Johnny Chung Lee, un integrante del Human-Computer Interaction Institute de la universidad de Carnegie Mellon quien ha realizado varios, como &eacute;l dice, &ldquo;Cool Tricks to do with the Wii Remote&rdquo;. Entre algunos de sus proyectos est&aacute; la implementaci&oacute;n de una pizarra interactiva de bajo costo, que es en lo que nos centraremos en este art&iacute;culo.
					                  <P class=contenidos>&nbsp;  &nbsp;  &nbsp;
 Mediante este proyecto se puede convertir una pared, una mesa o cualquier superficie plana en una pizarra interactiva. S&oacute;lo son necesarios: el Control Remoto Wii, una PC con conexi&oacute;n Bluetooth, un proyector y un l&aacute;piz que emita luz infrarroja. En la fotograf&iacute;a que aparece m&aacute;s abajo se puede ver, adem&aacute;s del control remoto y del adaptador USB-Bluetooth que se utilizaron, el l&aacute;piz que se construy&oacute;. A continuaci&oacute;n se describe el procedimiento para llevarlo a cabo, pero para observar el sistema en funcionamiento y terminar de entender de que hablamos basta ver el video de <a href="http://www.youtube.com/watch?v=5s5EvhHy7eQ"><span class="linkTexto">Johnny Lee</span></a> y la reproducci&oacute;n hecha en el <a href="http://www.youtube.com/watch?v=ML_-xXhqBuY"><span class="linkTexto">LINSE</span></a>.
					                  <P class=centro><img src="20080904/etiqueta.JPG"/></P><P class=contenidos>&nbsp;  &nbsp;  &nbsp;
 Primero, hay que construir el l&aacute;piz con un LED que emita luz en el rango de longitudes de onda del infrarrojo (IR) y un interruptor. Luego, es necesario conectar el Wii Remote con la computadora. &Eacute;sta debe tener una interfaz de radio Bluetooth con sus correspondientes drivers. S&oacute;lo hace falta detectar el control remoto, iniciar la conexi&oacute;n y habilitar el servicio de HID (Human Interface Device). Finalmente, teniendo previamente el proyector y el Wiimote apuntando a la superficie deseada, hay que ejecutar la aplicaci&oacute;n creada por Johnny Lee y realizar una calibraci&oacute;n de cuatro puntos sobre la proyecci&oacute;n. A partir de ese momento, cada vez que se presiona el interruptor del l&aacute;piz la computadora lo interpreta como un click del mouse. Con s&oacute;lo abrir el paint de Windows o cualquier programa similar se puede tener la mencionada pizarra interactiva.
					                     <P class=contenidos>&nbsp;  &nbsp;  &nbsp;
 Existen algunos detalles t&eacute;cnicos que hay que tener en cuenta para poder tener una implementaci&oacute;n exitosa. La ubicaci&oacute;n del control remoto es crucial ya que si &eacute;ste no &ldquo;ve&rdquo; la emisi&oacute;n IR producida por el l&aacute;piz, el sistema no funciona. Se encontr&oacute; que una buena posici&oacute;n del control es con un &aacute;ngulo de entre 30 y 45&ordm; respecto de la superficie en la que se proyecta y una ubicaci&oacute;n a una altura que no sea extremadamente distinta a la de los bordes superior e inferior de la proyecci&oacute;n. Otro &iacute;tem a tener en cuenta es que la superficie sobre la que se proyecta no deber&iacute;a ser muy rugosa. La &uacute;ltima aclaraci&oacute;n es que cuando dije &ldquo;un LED que emita luz en el rango de longitudes de onda del infrarrojo&rdquo; no estoy espec&iacute;ficando mucho (ese rango de longitudes de onda van desde los 750nm hasta 1mm). Supuestamente, el sensor IR es sensible a LEDs que emitan alrededor de 940nm. Esto quiere decir que quiz&aacute;s tengan que probar algunos de los LEDs que compren en la casa de electr&oacute;nica hasta encontrar el que funcione ya que dif&iacute;cilmente puedan comprar uno del cual sepan su marca de manera de tener las especificaciones. Vale la pena aclarar que esta aplicaci&oacute;n se puede extender para agregar a cualquier monitor la caracter&iacute;stica touch-screen con s&oacute;lo ubicar el Wiimote apuntando a la pantalla. Para obtener m&aacute;s informaci&oacute;n acerca de esta u otras implementaciones basta hacer una simple b&uacute;squeda en internet o acceder a <a href="http://www.cs.cmu.edu/~johnny/projects/wii/"><span class="linkTexto">http://www.cs.cmu.edu/~johnny/projects/wii/</span></a> o <a href="www.wiimoteproject.com"><span class="linkTexto">www.wiimoteproject.com</span></a>. Y si uno tiene deseos de empezar a indagar en relaci&oacute;n a algunos de los aspectos t&eacute;cnicos deber&iacute;a entrar a <a href="www.wiili.org/index.php/Wiimote/index.html"><span class="linkTexto">www.wiili.org/index.php/Wiimote</span></a>.
				                      <P class=contenidos>&nbsp;  &nbsp;  &nbsp;
 Lo que es importante recalcar es que m&aacute;s all&aacute; de esta aplicaci&oacute;n particular, que a pesar de ser &uacute;til no es indispensable, lo que se tiene es una plataforma que tiene la capacidad de medir sus movimientos y estimar su posici&oacute;n y que posee conexi&oacute;n inal&aacute;mbrica. Esto abre las puertas a la implementaci&oacute;n de nuevas ideas que involucran un tipo de interacci&oacute;n con la computadora al que no era habitual tener acceso.
				                      <P class=contenidos>&nbsp;  &nbsp;  &nbsp;
 Dentro del LINSE la intenci&oacute;n original es emplear el Wiimote en relaci&oacute;n con software de juegos, sin embargo su rango de aplicaci&oacute;n es mucho m&aacute;s amplio. Mientras que hay aplicaciones que surgen inmediatamente como variantes caseras de dispositivos ya disponibles en el mercado, como podr&iacute;a ser un control para presentaciones con diapositivas, existen otras no tan triviales que ya se est&aacute;n llevando a cabo. &Eacute;stas van desde dirigir un auto a control remoto, controlar en forma m&aacute;s intuitiva a Packbot (un robot que desarma bombas constru&iacute;do por el ej&eacute;rcito de EE.UU.), en pr&aacute;cticas para mejorar la coordinaci&oacute;n fina de las manos de los cirujanos (en el Banner Good Samaritan Medical Centre en Phoenix, Arizona, EE.UU.) y hasta ayudar a rehabilitar a pacientes que requieren mejorar la coordinaci&oacute;n de sus movimientos y fortalecer sus m&uacute;sculos (en el St. Mary's Medical Center en San Francisco, California, EE.UU.).			                  </P>
    </td>
<td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td width="386"></td>
    <td></td>
  </tr>
  <tr>
    <td colspan="2" valign="top"><div align="left">
            <p>&nbsp;</p>
            <p><a href="../feed.xml" target="_blank">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img border=0 src="../imagenes/rss.png"></a></p>
          </div></td>
    <td>&nbsp;</td>
    <td>&nbsp;</td>
    <td></td>
  </tr>
  <tr>
    <td colspan="4" valign="top" class="menu_pie"><a href="about_us.htm" target="_self"> sobre nosotros</a> <span class="secciones">| <a href="research.htm" target="_self">investigaci&oacute;n</a> |</span> <a href="publications.htm" target="_self">publicaciones</a> <span class="secciones">|</span> <a href="technology.htm" target="_self">transferencia de t.</a> <span class="secciones">|</span> <a href="capabilities.htm" target="_self">capacidades</a> </td>
  </tr>
  <tr>
    <td colspan="6" valign="bottom" nowrap><img src="../imagenes/barra_down.gif" width="830" height="43" border="0" usemap="#Map"></td>
  </tr>
</table>
<map name="Map">
  <area shape="rect" coords="609,-31,743,22" href="http://www.amplioespectro.com" target="_blank">
</map>
</body>
</html>

<!-- Localized -->