<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Lifia</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="shortcut icon" href="../../imagenes/lifiaicon.ico" >
<style type="text/css">
<!--
@import url("../estilos_lifia.css");
body {
	background-color: #bec2d1;
	margin-left: 0px;
	margin-top: 5px;
	margin-right: 0px;
	margin-bottom: 0px;
	background-image: url();
}
a:link {
	color: #255282;
	text-decoration: none;
}
a:visited {
	text-decoration: none;
	color: #255282;
}
a:hover {
	text-decoration: none;
	color: #FF9933;
}
a:active {
	text-decoration: none;
	color: #FF9933;
}
.Estilo4 {color: #666666}
.Estilo8 {color: #1EA173}
.Estilo9 {color: #333399}

.centro{FONT-SIZE: 13px; COLOR: #666666; font-weight:bold;FONT-FAMILY: "Trebuchet MS", Verdana;
text-align:center;}
.linkTexto {
		COLOR: #0033CC; 	text-decoration:underline;
		font-weight:bold;}
-->
</style>
</head>

<body>
<script type="text/javascript" src="wz_tooltip.js"></script>
<table width="830" border="0" align="center" cellpadding="0" cellspacing="0" background="../imagenes/line_830.gif">
  <!--DWLayoutTable-->
  <tr>
    <td width="30" rowspan="7" valign="top"><img src="../imagenes/spacer_izq2.gif" width="30" height="615"></td>
    <td colspan="4" valign="top"><table width="780" height="114" border="0" cellpadding="0" cellspacing="0">
        <!--DWLayoutTable-->
        <tr>
          <td width="780" height="170" valign="top"><img src="../imagenes/top_difusion.gif" width="780" height="172" border="0" usemap="#Map"></td>
        </tr>
    </table></td>
  <td width="20" rowspan="7" valign="top"><img src="../imagenes/spacer_der2.gif" width="20" height="485"></td>
  </tr>
  <tr>
    <td width="247" rowspan="4" valign="top"><table width="247" border="0" cellpadding="0" cellspacing="0">
        <!--DWLayoutTable-->
        <tr>
          <td height="19" colspan="3" valign="top"><img src="../imagenes/spacer_vert_19.gif" width="10" height="19"></td>
        </tr>
        <tr>
          <td width="41" rowspan="7" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../index.htm" target="_self">Bienvenida</a></td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../about_us.htm" target="_self">Sobre nosotros</a> </td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../research.htm">Investigaci&oacute;n</a> </td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap><span class="menu_izq"> <a href="../publications.htm" target="_self">Publicaciones </a></span> &#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../technology.htm" target="_self">Transferencia de tec. &amp; servicios </a>&#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" class="menu_izq"><span class="menu_izq Estilo8"> <a href="../capabilities.htm">Capacidades &#13;</a><strong> <a href="capabilities.htm">&#13;&#13;</a></strong></span> &#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top"><a href="../difusion.htm" class="menu_izq"><strong>Difusi&oacute;n</strong></a></td>
        </tr>
        <tr>
          <td height="57">&nbsp;</td>
          <td width="84">&nbsp;</td>
          <td width="122">&nbsp;</td>
        </tr>
        <tr>
          <td height="84" colspan="3" valign="top"><img src="../imagenes/spacer_vert_84.gif" width="10" height="84"></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../sitemap.htm" target="_self">mapa del sitio</a> </div></td>
              <td rowspan="5" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita"><a href="../staff.htm" target="_self">staff</a></div></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../contact.htm" target="_self">contacto</a></div></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../../en/index.htm" target="_self">english version</a> </div></td>
        </tr>
        <tr>
          <td height="16"></td>
          <td></td>
        </tr>
		        <tr>
		          <td>&nbsp;</td>
                  <td>&nbsp;</td>
                  <td>&nbsp;</td>
        </tr>
		
                </table></td>
    <td width="40"></td>
    <td width="386" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
        <td width="107"></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="titulo_principal_cap Estilo9">Tesis Cano-Trilla</td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="titulo_secundario"><span class="contenidos_titulos">(por  Diego Cano y Gisela Trilla) </span>  - 05/Mayol/2008 - <a href="20080508.htm"><strong>Permalink</strong></a> </td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="parrafo_normal">
              <P class=contenidos>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;  En su m&aacute;s amplio sentido, un Sistema de Informaci&oacute;n Geogr&aacute;fica (SIG) es cualquier conjunto de procedimientos manuales o computarizados utilizados para almacenar y manipular datos referenciados geogr&aacute;ficamente.<br>
               <br>
                &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Existen otros tipos de sistemas que de una u otra manera gestionan informaci&oacute;n espacial o geogr&aacute;fica, entre estos cabr&iacute;a mencionar a los sistemas de almacenamiento y gesti&oacute;n de mapas digitales o sistemas CAD (Computer Aided Design), utilizados mayormente en ingenier&iacute;a y arquitectura. La caracter&iacute;stica distintiva entre estos sistemas y un SIG reside en que &eacute;ste agrega informaci&oacute;n geogr&aacute;fica a la informaci&oacute;n del dominio de aplicaci&oacute;n (la georeferencia) manteniendo un fuerte v&iacute;nculo entre ellas. De esta manera, un SIG permitir&aacute; responder consultas que involucren informaci&oacute;n combinada de ambos aspectos (geogr&aacute;fico y del dominio). Consultas tales como encontrar la ruta m&aacute;s r&aacute;pida en autom&oacute;vil para unir dos puntos dentro de una ciudad involucran no s&oacute;lo a un mapa, sino tambi&eacute;n informaci&oacute;n sobre el flujo de tr&aacute;nsito dependiente del horario, como as&iacute; tambi&eacute;n informaci&oacute;n de cortes de calles por manifestaciones o refacciones (quiz&aacute;s provenientes de otros sistemas, lo que puede requerir conectividad del SIG con ellos). En &eacute;ste caso, el mapa digital constituir&iacute;a s&oacute;lo una de las alternativas en la que el SIG podr&iacute;a presentar la informaci&oacute;n de salida de la consulta.<br>
                <br>
                &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Es importante destacar que un SIG no es una aplicaci&oacute;n concreta, sino que constituye un kernel, un conjunto de m&eacute;todos para la gesti&oacute;n de datos georeferenciados que cualquier aplicaci&oacute;n concreta de cualquier dominio puede utilizar. Las aplicaciones concretas en que se utiliza un SIG actualmente son 
              muy numerosa&lt;s y sobre todo diversas, como ejemplo pueden citarse: Agricultura y Planeamiento de Uso de la Tierra, Control Forestal, Arqueolog&iacute;a, Geolog&iacute;a, Planeamiento Urbano, Catastro, Control Epidemiol&oacute;gico, Control Policial, Asistencia en Robos de Veh&iacute;culos, Marketing.<br>
              <br>
                &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Para alcanzar sus objetivos un SIG debe contar con formas muy particulares de gestionar la informaci&oacute;n en aspectos tales como su captura (GPS, Remote Sensing, Fotograf&iacute;a A&eacute;rea o Satelital), procesamiento (Sistemas de Referencia, Topolog&iacute;a) y presentaci&oacute;n (Mapas Digitales en diversos formatos, adem&aacute;s de las formas tradicionales).</P>
             <P class=contenidos><strong>               Objetivos y resultados esperados</strong><br>
               <br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;               El objetivo del trabajo propuesto consiste en el dise&ntilde;o de un modelo Orientado a Objetos que contemple los principales aspectos de un SIG, pero con una gran flexibilidad en la elecci&oacute;n, configuraci&oacute;n y extensi&oacute;n de varios de ellos por parte del usuario final. Esto significa que el modelo no impondr&aacute; implementaciones particulares para estas partes, sino que proveer&aacute; un conjunto de ellas de las cuales el usuario final podr&aacute; elegir la que m&aacute;s se adapte a su caso particular; incluso podr&aacute; agregar otras nuevas que considere m&aacute;s adecuadas que las ofrecidas, sin reparar en problemas de coexistencia e integraci&oacute;n con el resto del sistema. Entendemos que esta flexibilidad en el dise&ntilde;o ayudar&aacute; a los usuarios de sistemas SIG a acortar la distancia entre la generalidad de las herramientas y sus problemas particulares. <br>
<br>
               &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; En concreto, los aspectos que se contemplar&aacute;n en este trabajo son los siguientes: Sistema de      Referencias, Modelo Topol&oacute;gico, Estructuras de Indizaci&oacute;n Geogr&aacute;fica y Estrategias de Geometr&iacute;a Computacional.<br>
               <br>
               &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; El Sistema de Referencias permitir&aacute; definir la ubicaci&oacute;n espacial de los objetos y la realizaci&oacute;n de operaciones tales como el c&aacute;lculo de la distancia entre ellos, o el del &aacute;rea ocupada por el per&iacute;metro definido por un conjunto de los mismos. Existen varios Sistemas de Referencias y cada uno de ellos tiene sus ventajas y desventajas dependiendo del dominio de aplicaci&oacute;n, es por esto que el modelo contemplar&aacute; algunos de ellos y quedar&aacute; abierto para una f&aacute;cil extensi&oacute;n con otros.<br>
               <br>
               &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; El Modelo Topol&oacute;gico permite definir la forma de los objetos y facilitar los operaciones que dependen s&oacute;lo de ellas y de su ubicaci&oacute;n relativa, es decir, sin depender de su ubicaci&oacute;n exacta en el espacio. Por ejemplo, podr&iacute;a almacenarse informaci&oacute;n sobre si un pol&iacute;gono incluye a otro, y esto permitir&iacute;a responder r&aacute;pidamente a la consulta de inclusi&oacute;n sin necesidad de recurrir a operaciones matem&aacute;ticas que incluyan coordenadas.<br>
               <br>
               &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Las Estructuras de Indizaci&oacute;n Geogr&aacute;fica permitir&aacute;n un r&aacute;pido acceso a los objetos geogr&aacute;ficos y la formulaci&oacute;n de consultas con par&aacute;metros espaciales, como por ejemplo la obtenci&oacute;n de todos los objetos que se encuentran en un &aacute;rea dada como dato. Existen varias Estructuras de Indizaci&oacute;n, cada una con diferentes prestaciones; en este trabajo se contemplar&aacute;n el Quad-Tree, el K-D-Tree, el R-Tree y algunas variantes; &eacute;stas se definir&aacute;n mediante una interfaz gen&eacute;rica de manera de dejar el modelo abierto a nuevas estructuras que el usuario final desee agregar y utilizar.</P>
             <P class=contenidos>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;                Las Estrategias de Geometr&iacute;a Computacional son algoritmos que se utilizan para la realizaci&oacute;n de operaciones y testeos geom&eacute;tricos, como por ejemplo el c&aacute;lculo de la uni&oacute;n e intersecci&oacute;n de pol&iacute;gonos o testeos de inclusi&oacute;n espacial. Existen varias estrategias alternativas para cada operaci&oacute;n, cada una con ventajas dependientes de aspectos particulares, por ejemplo del tama&ntilde;o de los pol&iacute;gonos. Es por esto que constituye una ventaja el hecho de ofrecer varias de ellas de modo que el usuario seleccione la m&aacute;s apropiada para su dominio de aplicaci&oacute;n.<br>
               <br>
               &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Adem&aacute;s, existe la complejidad adicional de combinar todas estas partes de manera que siempre se d&eacute; una correcta interacci&oacute;n entre las mismas, sean cuales fueren sus eventuales implementaciones.<br>
               <br>
               &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Si bien se realizar&aacute; el dise&ntilde;o completo del modelo, debido a su complejidad no se realizar&aacute; la implementaci&oacute;n ejecutable completa, sino s&oacute;lo de algunas de las partes mencionadas; se implementar&aacute;n algunas estructuras de indizaci&oacute;n (como el R-Tree y el Quad-Tree) y algunas de las estrategias m&aacute;s relevantes de geometr&iacute;a computacional.<br>
               <br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;               Para ejemplificar el uso del modelo propuesto se tomar&aacute; un dominio concreto y se realizar&aacute; el dise&ntilde;o de una aplicaci&oacute;n sobre el mismo.<br>
<br>
<A href="Tesis_Cano_Trilla_FINAL.pdf"><span class="linkTexto">Tesis</SPAN></A><br>
              </P>    </td>
<td></td>
  </tr>
  
  <tr>
    <td colspan="2" valign="top"><div align="left">
            <p>&nbsp;</p>
            <p><a href="../feed.xml" target="_blank">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img border=0 src="../imagenes/rss.png"></a></p>
          </div></td>
    <td>&nbsp;</td>
    <td>&nbsp;</td>
    <td></td>
  </tr>
  <tr>
    <td colspan="4" valign="top" class="menu_pie"><a href="about_us.htm" target="_self"> sobre nosotros</a> <span class="secciones">| <a href="research.htm" target="_self">investigaci&oacute;n</a> |</span> <a href="publications.htm" target="_self">publicaciones</a> <span class="secciones">|</span> <a href="technology.htm" target="_self">transferencia de t.</a> <span class="secciones">|</span> <a href="capabilities.htm" target="_self">capacidades</a> </td>
  </tr>
  <tr>
    <td colspan="6" valign="bottom" nowrap><img src="../imagenes/barra_down.gif" width="830" height="43" border="0" usemap="#Map"></td>
  </tr>
</table>
<map name="Map">
  <area shape="rect" coords="609,-31,743,22" href="http://www.amplioespectro.com" target="_blank">
</map>
</body>
</html>

<!-- Localized -->