<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Lifia</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="shortcut icon" href="../../imagenes/lifiaicon.ico" >
<style type="text/css">
<!--
@import url("../estilos_lifia.css");
body {
	background-color: #bec2d1;
	margin-left: 0px;
	margin-top: 5px;
	margin-right: 0px;
	margin-bottom: 0px;
	background-image: url();
}
a:link {
	color: #255282;
	text-decoration: none;
}
a:visited {
	text-decoration: none;
	color: #255282;
}
a:hover {
	text-decoration: none;
	color: #FF9933;
}
a:active {
	text-decoration: none;
	color: #FF9933;
}
.Estilo4 {color: #666666}
.Estilo8 {color: #1EA173}
.Estilo9 {color: #333399}

.centro{FONT-SIZE: 13px; COLOR: #666666; font-weight:bold;FONT-FAMILY: "Trebuchet MS", Verdana;
text-align:center;}
.linkTexto {
		COLOR: #0033CC; 	text-decoration:underline;
		font-weight:bold;}
-->
</style>
</head>

<body>
<script type="text/javascript" src="wz_tooltip.js"></script>
<table width="830" border="0" align="center" cellpadding="0" cellspacing="0" background="../imagenes/line_830.gif">
  <!--DWLayoutTable-->
  <tr>
    <td width="30" rowspan="8" valign="top"><img src="../imagenes/spacer_izq2.gif" width="30" height="615"></td>
    <td colspan="4" valign="top"><table width="780" height="114" border="0" cellpadding="0" cellspacing="0">
        <!--DWLayoutTable-->
        <tr>
          <td width="780" height="170" valign="top"><img src="../imagenes/top_difusion.gif" width="780" height="172" border="0" usemap="#Map"></td>
        </tr>
    </table></td>
  <td width="20" rowspan="8" valign="top"><img src="../imagenes/spacer_der2.gif" width="20" height="485"></td>
  </tr>
  <tr>
    <td width="247" rowspan="5" valign="top"><table width="247" border="0" cellpadding="0" cellspacing="0">
        <!--DWLayoutTable-->
        <tr>
          <td height="19" colspan="3" valign="top"><img src="../imagenes/spacer_vert_19.gif" width="10" height="19"></td>
        </tr>
        <tr>
          <td width="41" rowspan="7" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../index.htm" target="_self">Bienvenida</a></td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../about_us.htm" target="_self">Sobre nosotros</a> </td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../research.htm">Investigaci&oacute;n</a> </td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap><span class="menu_izq"> <a href="../publications.htm" target="_self">Publicaciones </a></span> &#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../technology.htm" target="_self">Transferencia de tec. &amp; servicios </a>&#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" class="menu_izq"><span class="menu_izq Estilo8"> <a href="../capabilities.htm">Capacidades &#13;</a><strong> <a href="capabilities.htm">&#13;&#13;</a></strong></span> &#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top"><a href="../difusion.htm" class="menu_izq"><strong>Difusi&oacute;n</strong></a></td>
        </tr>
        <tr>
          <td height="57">&nbsp;</td>
          <td width="84">&nbsp;</td>
          <td width="122">&nbsp;</td>
        </tr>
        <tr>
          <td height="84" colspan="3" valign="top"><img src="../imagenes/spacer_vert_84.gif" width="10" height="84"></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../sitemap.htm" target="_self">mapa del sitio</a> </div></td>
              <td rowspan="5" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita"><a href="../staff.htm" target="_self">staff</a></div></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../contact.htm" target="_self">contacto</a></div></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../../en/index.htm" target="_self">english version</a> </div></td>
        </tr>
        <tr>
          <td height="16"></td>
          <td></td>
        </tr>
		        <tr>
		          <td>&nbsp;</td>
                  <td>&nbsp;</td>
                  <td>&nbsp;</td>
        </tr>
		
                </table></td>
    <td width="40"></td>
    <td valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
        <td width="107"></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="titulo_principal_cap Estilo9">Javascript</td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="titulo_secundario">(<span class="contenidos_titulos">por Leandro Yalet)</span> - </span> 03/Abril/2008 - <a href="20080403.htm"><strong>Permalink</strong></a> </td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="parrafo_normal"><P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;	  &nbsp;&nbsp;      JavaScript fue originalmente desarrollado por Brendan Eich para Netscape bajo el nombre Mocha, luego llamado LiveScript y finalmente renombrado JavaScript. El cambio de nombre de LiveScript a JavaScript coincide aproximadamente con el soporte de Netscape para las tecnolog&iacute;as Java y fue incorporado en 1995 en el Netscape Navigaror 2.0 beta.<br>
								 	  <br>
								           &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Como noticia de &uacute;ltimo momento en Diciembre AOL (que compr&oacute; a Netscape hace unos a&ntilde;os) fij&oacute; la fecha del entierro para el <a href="http://blog.netscape.com/2007/12/28/end-of-support-for-netscape-web-browsers/"><span class="linkTexto">Netscape Navigator</span></a>, a partir del 1 de febrero de este a&ntilde;o dej&oacute; de dar soporte, con lo cual la cuna de JavaScript dej&oacute; de existir. Para m&aacute;s informaci&oacute;n en este link hay una l&iacute;nea temporal de <a href="http://en.wikipedia.org/wiki/Image:Timeline_of_web_browsers.svg"><span class="linkTexto">navegadores web</span></a>.<br>
								           <br>
								           &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Para continuar con el pie correcto,  se debe aclarar que JavaScript != Java (para los smalltalkers JavaScript ~= Java), simplemente se tom&oacute; la popularidad que ten&iacute;a Java en sus comienzos. Las aplicaciones Java son independientes de una p&aacute;gina web y compiladas en bytecodes, mientras que los programas JavaScript est&aacute;n embebidos en una p&aacute;gina web y deben correr en un browser.<br>
								           <br>
								           &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; La idea original fue hacer la programaci&oacute;n m&aacute;s accesible que Java y de alg&uacute;n modo hacer que el navegador de Netscape sea m&aacute;s abierto para quienes no programaran en ese lenguaje. <br>
								           <br>
								           &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; En cuanto a la sintaxis JavaScript es similar a C, Perl y Java. Por ejemplo las sentencias if, while y los loops for son id&eacute;nticas. Al igual que Perl, es un lenguaje orientado a objetos, interpretado y no compilado.<br>
								           <br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;								           A ra&iacute;z de que JavaScript est&aacute; asociado con un navegador, est&aacute; altamente integrado con HTML. Mientras HTML es manejado por la propia biblioteca de red y de renderizador de gr&aacute;ficos, los scripts de JavaScript pueden ser ejecutados por un int&eacute;rprete normalmente incorporado al navegador. Cuando el navegador solicita una p&aacute;gina,  el servidor env&iacute;a el contenido total de un documento, incluyendo HTML y sentencias JavaScript, a trav&eacute;s de la red hacia el cliente. Cuando la p&aacute;gina carga, el contenido HTML es le&iacute;do y renderizado l&iacute;nea por l&iacute;nea hasta la apertura de un tag de JavaScript, a partir de ese momento el int&eacute;rprete de JavaScript toma el control. Cuando el tag de cierre es alcanzado,  el proceso del HTML contin&uacute;a.<br>
<br>
								           &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Cuando hablamos de un int&eacute;rprete de JavaScript en un navegador se trata de client-side JavaScript (CSJS). A pesar de que JavaScript es altamente utilizado como un lenguaje client-side y embebido en un navegador web,  puede ser usado en contextos distintos de un navegador, por ejemplo Adobe Acrobat y Adobe Reader. Netscape cre&oacute; un server-side JavaScript (SSJS) llamado LiveWire para que sea programado como un lenguaje CGI como Perl o ASP.<br>
								           <br>
						              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; El motor m&aacute;s conocido es el SpiderMonkey (code name adquirido en Netscape) que fue convertido en open source. Ejemplo de aplicaciones que utilicen este motor es el tan conocido navegador Mozilla Firefox y Yahoo Widgets. Pero SpiderMonkey, desarrollado en C, tiene un hermano llamado Rhino, implementado completamente en Java. Rhino es utilizado en los servidores <a href="http://www.helma.org/"><span class="linkTexto">Helma</span></a> y <a href="https://phobos.dev.java.net/"><span class="linkTexto">Phobos</span></a>. Rhino es parte de la JDK 6.<br>
						              <br>
						              <strong>Qu&eacute; no es JavaScript</strong><br>
						              <br>
						              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; JavaScript no es HTML, pero un script puede estar embebido en un documento HTML y contenido dentro de tags HTML. Javascript no comprende HTML pero puede contenerlo dentro de sus sentencias.<br>
						              <br>
						              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; JavaScript est&aacute; basado en objetos pero no es estrictamente orientado a objetos porque no soporta el tradicional mecanismo de herencia y las clases encontradas en lenguajes orientados a objetos como Smalltalk, Java o C++. Palabras reservadas como private, protected y public no son aplicables a los m&eacute;todos de JavaScript como en Java y C++.<br>
						              <br>
						              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; JavaScript no es el &uacute;nico lenguaje que puede ser embebido en una p&aacute;gina web. VBScript por ejemplo, desarrollado por Microsoft, es parecido a JavaScript pero funciona &uacute;nicamente en Internet Explorer.<br>
						              <br>
						              <strong>						              Los usos de JavaScript</strong><br>
						              <br>
						              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Como dir&iacute;a una conocida lifiana &ldquo;&iquest;Pa&rsquo; que sirve?&rdquo;[1], los programas JavaScript son usados para detectar y reaccionar a los eventos iniciados por el usuario, como el movimiento del mouse sobre un link o una imagen. Estos pueden mejorar una p&aacute;gina con ayuda en la navegaci&oacute;n, mostrando mensajes, cajas de di&aacute;logo, intercambio de im&aacute;genes (algo que todav&iacute;a se utiliza), carritos de compra y as&iacute; sucesivamente. JavaScript da el control a la apariencia de las p&aacute;ginas desde el comienzo del parseo del documento. Sin ninguna comunicaci&oacute;n con el servidor es posible validar lo que el usuario ingres&oacute; en un formulario antes de que lo env&iacute;e. Se puede verificar qu&eacute; plug-ins posee el usuario y enviarlo  a otra p&aacute;gina para que obtenga los plug-ins que necesite. Posee funciones para strings y expresiones regulares para validar direcciones de mail, n&uacute;meros de tel&eacute;fono, etc&eacute;tera. Es usado para c&aacute;lculos aritm&eacute;ticos, manejos de fechas y tiempo, y trabaja con arreglos, strings y objetos. Adem&aacute;s puede leer y escribir cookies y crear din&aacute;micamente HTML.<br>
						              <br>
						              <strong>						              Una historia con muchos problemas</strong><br>
						              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <br>
						              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Los programadores web encontraron en JavaScript una programaci&oacute;n divertida. Hasta cierto punto, eso  signific&oacute;  que  muchos  programadores  no  lo tomaran en serio. Originalmente un sufrimiento para muchos, comenz&oacute; siendo aceptado por cientos de programadores. Como los navegadores se hicieron m&aacute;s poderosos y pod&iacute;an ejecutar scripts m&aacute;s r&aacute;pido, los programadores descubrieron que Javascript era, en verdad, una herramienta viable de desarrollo. Y todo tomaba unas pocas l&iacute;neas de c&oacute;digo para hacer que funcionen las cosas.<br>
						              <br>
						              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; JavaScript comenzaba a hacer olas y Microsoft, el competidor de Netscape, no pudo ignorar la situaci&oacute;n y decidi&oacute; crear su propia versi&oacute;n de JavaScript a la cual llam&oacute; Jscript.</P>
 							             <P class=contenidos>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
 							               La primera versi&oacute;n oficial de JScript fue liberada en Julio de 1996, en el Internet Explorer 3.0. A partir de entonces hab&iacute;a JavaScript y JScript, y el resultado de esta divisi&oacute;n del lenguaje de Netscape y Microsoft tuvo repercusiones que tienen eco hoy en d&iacute;a. El original JScript era una versi&oacute;n mucho m&aacute;s reducida que JavaScript 1.1 y las diferencias confund&iacute;an a los programadores. En ese punto, Microsoft cre&oacute; su propio lenguaje de script, VBScript, basado en Visual Basic, y tuvo la esperanza de ser un pr&oacute;spero rival de JavaScript, pero este &uacute;ltimo fue el ganador.<br>
 							               <br>
 							               &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
 							               Microsoft con JScript, para traer un completo soporte para JavaScript 1.1, relanz&oacute; una segunda versi&oacute;n de Internet Explorer 3.0. Entonces comenzaron los problemas de cross-browser y versiones cross-browser en los scripts, problemas que hacen dif&iacute;cil la vida de los programadores de JavaScript desde entonces. Los programadores  descubrieron que aunque JScript se parec&iacute;a a JavaScript, algunos scripts corr&iacute;an en Netscape y no en Internet Explorer y viceversa.<br>
 							               <br>
 							               &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;  							               Con la esperanza de detener el caos, Netscape y Sun buscaron una tercera parte que estandarizara JavaScript, y se dirigieron hacia la European Computer Manufacturers Association (ECMA, <a href="http://www.ecma.ch"><span class="linkTexto">http://www.ecma.ch</span></a>).<br>
 							               <br>
 							               &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Desafortunadamente para los programadores, la estandarizaci&oacute;n, que comenz&oacute; a fines de 1996, tom&oacute; mucho tiempo, y mucho m&aacute;s tiempo en ser adoptado. Uno hubiese esperado que el lenguaje estandarizado se llamase JavaScript o JScript, pero en vez de eso se llam&oacute; ECMAScript. Entonces actualmente tenemos tres est&aacute;ndares: JavaScript, JScript y ECMAScript.<br>
 							               <br>
 							               &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A pesar de que ECMAScript tuvo cierta cantidad coherente de aciertos, ambos navegadores fueron por sus propios caminos. El resultado es que Internet Explorer permiti&oacute; dos maneras para hacer las cosas (JScript y ECMAScript) y Netscape lo hizo a la manera de JavaScript y ECMAScript. Un gran problema fue que ECMAScript ten&iacute;a estandarizado el n&uacute;cleo de JavaScript en s&iacute; mismo, pero no todos los recursos estaban disponibles en los navegadores.<br>
 							               <br>
 							               &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Estos recursos est&aacute;n constituidos por los &ldquo;browser objects&rdquo;. Cada navegador ten&iacute;a su propio conjunto de objetos, como el objeto document, que permite que uno trabaje con la p&aacute;gina web  y el objeto window que permite trabajar con el browser en s&iacute; mismo. Una gran cantidad de la programaci&oacute;n de JavaScript es sobre los lineamientos de estos objetos.Estos son enteramente diferentes en los dos navegadores, es f&aacute;cil ver que el mismo script tenga problemas en uno o el resto de los navegadores (por eso mismo muchos hoy en d&iacute;a siguen programando diferentes scripts para la misma p&aacute;gina web para los distintos navegadores).<br>
 							               <br>
 							               &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; El caos fue puesto a la vista por los diferentes conjuntos de objetos de los navegadores amenazando a JavaScript y JScript, entonces Microsoft, Netscape y muchas otras corporaciones de la World Wide Web Consortium (W3C, <a href="http://www.w3.org"><span class="linkTexto">http://www.w3.org</span></a>) aportaron coherencia a estos objetos para poder construir un JavaScript accesible.<br>
 							               <br>
 							               &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; El conjunto original de objetos, antes de que la W3C comenzara su trabajo, lleg&oacute; a ser conocido como Document Object Model (DOM) &quot;level 0&quot;. El DOM level 1, el cual lleg&oacute; a ser una especificaci&oacute;n de la W3C oficial a fines de 1998, estandariz&oacute; muchos aspectos de los objetos encontrados en los navegadores, pero dej&oacute; afuera a muchos otros. DOM level 2 fue creado como especificaci&oacute;n en Noviembre de 2000 y complet&oacute; mucho m&aacute;s detalles. DOM level 3 introduce, entre otras cosas,  Xpath.<br>
 							               <br>
 							               <strong>La curva de la evoluci&oacute;n</strong><br>
 							               <br>
 							             &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; El mundo JavaScript hizo un gran avance desde su edad de piedra con peque&ntilde;os scripts que llenaban  la pantalla de &ldquo;alerts&rdquo;, banners, menues desplegables, im&aacute;genes  que  se  intercambiaban  al pasar el mouse por encima, etc&eacute;tera; a este tipo de cosas se las conoce como DHTML: Dynamic HMTL que consiste en la combinaci&oacute;n de HTML 4.0, el Document Object Model (DOM), JavaScript y CSS (Cascading Style Sheets). Desde el estilo inicial que contenga una p&aacute;gina con CSS podemos comenzar utilizando el DOM y JavaScript para cambiar din&aacute;micamente el estilo de la p&aacute;gina luego de que fu&eacute; cargada. <br>
								           <br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;								           La utilizaci&oacute;n de frames en las p&aacute;ginas para cargar otras m&aacute;s peque&ntilde;as necesit&oacute; de JavaScript para establecer una comunicaci&oacute;n entre las mismas, este tipo de t&eacute;cnica era una manera primitiva de lo que conocemos como Ajax, este t&eacute;rmino fue acu&ntilde;ado recientemente en el 2005. Con la llegada del objeto XMLHttpRequest comenzaron a aparecer peque&ntilde;as bibliotecas para utilizar dicha t&eacute;cnica. <br>
<br>
								           &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Actualmente y a ra&iacute;z de la denominada Web 2.0, que todo el mundo conoce pero que abarca muchos conceptos, podemos encontrar bibliotecas que permiten portabilidad y claridad en el c&oacute;digo entre otras cosas,  por fomentar el uso de una notaci&oacute;n orientada a objetos.<br>
								           <br>
								           &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Lo que menos uno se imagin&oacute; es que al utilizar cualquiera de estas herramientas el trabajo se ver&iacute;a reducido en muchas l&iacute;neas de c&oacute;digo y cuando se habla de muchas,  cabe aclarar que este tipo de bibliotecas se encarga de parchear aquellas particularidades de cada browser creando de esta manera scripts cross-browser. Una maravillosa consecuencia es la reinvenci&oacute;n de la rueda[2] pero versi&oacute;n Web 2.0: por ejemplo menues desplegables pero animados con efectos y configurables. Pero m&aacute;s all&aacute; de lo que se pueda decir,  la comunidad que se encarga de utilizar y crear estas bibliotecas,  se preocupa por cumplir con los est&aacute;ndares y hoy en d&iacute;a se puede encontrar una extensa documentaci&oacute;n del uso de sus APIs. En las primeras &eacute;pocas era muy com&uacute;n realizar copy-paste de lo que encontraba, lo mejoraba y verificaba su funcionamiento, pero la nueva costumbre es utilizar distintos bibliotecas e incorporar distintos accesorios para armar un nuevo script con mucha m&aacute;s funcionalidad y compartirlo con la comunidad.<br>
								           <br>
								           &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; En esta l&iacute;nea de tiempo sobre selectores de CSS[3] se puede ver la explosi&oacute;n de estas <a href="http://paul.irish.aurgasm.us/2008/javascript-css-selector-engine-timeline/"><span class="linkTexto">bibliotecas</span></a><br>
								           entre los a&ntilde;os 2006 y 2007. El 2008 deparar&aacute; muchas m&aacute;s sorpresas y tal vez en octubre est&eacute; lista la versi&oacute;n 2 de JavaScript (hoy en d&iacute;a la mayor&iacute;a de los navegadores implementar la versi&oacute;n 1.7) que traer&aacute; consigo clases, interfaces, paquetes y muchas <a href="http://developer.mozilla.org/presentations/xtech2006/javascript/"><span class="linkTexto">mejoras</span></a>.<br>
								           <br>
							             &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; En la pr&oacute;xima nota nos encargaremos de enfocarnos en casos puntuales con ejemplificaci&oacute;n y prometemos que ser&aacute; mucho m&aacute;s corta :)<br>
						                 <br>
						              [1] Pista: fue ganadora del Yeste.<br>
						              [2] El hombre reinvent&oacute; la rueda: el rulem&aacute;n.<br>
						              [3] En las pr&oacute;ximas notas daremos ejemplos de esta funcionalidad.<br>
						              &nbsp;<br>
      <p></p>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td width="386"></td>
    <td></td>
  </tr>
  <tr>
    <td colspan="2" valign="top"><div align="left">
            <p>&nbsp;</p>
            <p><a href="../feed.xml" target="_blank">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img border=0 src="../imagenes/rss.png"></a></p>
          </div></td>
    <td>&nbsp;</td>
    <td>&nbsp;</td>
    <td></td>
  </tr>
  <tr>
    <td colspan="4" valign="top" class="menu_pie"><a href="about_us.htm" target="_self"> sobre nosotros</a> <span class="secciones">| <a href="research.htm" target="_self">investigaci&oacute;n</a> |</span> <a href="publications.htm" target="_self">publicaciones</a> <span class="secciones">|</span> <a href="technology.htm" target="_self">transferencia de t.</a> <span class="secciones">|</span> <a href="capabilities.htm" target="_self">capacidades</a> </td>
  </tr>
  <tr>
    <td colspan="6" valign="bottom" nowrap><img src="../imagenes/barra_down.gif" width="830" height="43" border="0" usemap="#Map"></td>
  </tr>
</table>
<map name="Map">
  <area shape="rect" coords="609,-31,743,22" href="http://www.amplioespectro.com" target="_blank">
</map>
</body>
</html>

<!-- Localized -->