<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Lifia</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="shortcut icon" href="../../imagenes/lifiaicon.ico" >
<style type="text/css">
<!--
@import url("../estilos_lifia.css");
body {
	background-color: #bec2d1;
	margin-left: 0px;
	margin-top: 5px;
	margin-right: 0px;
	margin-bottom: 0px;
	background-image: url();
}
a:link {
	color: #255282;
	text-decoration: none;
}
a:visited {
	text-decoration: none;
	color: #255282;
}
a:hover {
	text-decoration: none;
	color: #FF9933;
}
a:active {
	text-decoration: none;
	color: #FF9933;
}
.Estilo4 {color: #666666}
.Estilo8 {color: #1EA173}
.Estilo9 {color: #333399}

.centro{FONT-SIZE: 13px; COLOR: #666666; font-weight:bold;FONT-FAMILY: "Trebuchet MS", Verdana;
text-align:center;}
.linkTexto {
		COLOR: #0033CC; 	text-decoration:underline;
		font-weight:bold;}
-->
</style>
</head>

<body>
<script type="text/javascript" src="wz_tooltip.js"></script>
<table width="830" border="0" align="center" cellpadding="0" cellspacing="0" background="../imagenes/line_830.gif">
  <!--DWLayoutTable-->
  <tr>
    <td width="30" rowspan="8" valign="top"><img src="../imagenes/spacer_izq2.gif" width="30" height="615"></td>
    <td colspan="4" valign="top"><table width="780" height="114" border="0" cellpadding="0" cellspacing="0">
        <!--DWLayoutTable-->
        <tr>
          <td width="780" height="170" valign="top"><img src="../imagenes/top_difusion.gif" width="780" height="172" border="0" usemap="#Map"></td>
        </tr>
    </table></td>
  <td width="20" rowspan="8" valign="top"><img src="../imagenes/spacer_der2.gif" width="20" height="485"></td>
  </tr>
  <tr>
    <td width="247" rowspan="5" valign="top"><table width="247" border="0" cellpadding="0" cellspacing="0">
        <!--DWLayoutTable-->
        <tr>
          <td height="19" colspan="3" valign="top"><img src="../imagenes/spacer_vert_19.gif" width="10" height="19"></td>
        </tr>
        <tr>
          <td width="41" rowspan="7" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../index.htm" target="_self">Bienvenida</a></td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../about_us.htm" target="_self">Sobre nosotros</a> </td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../research.htm">Investigaci&oacute;n</a> </td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap><span class="menu_izq"> <a href="../publications.htm" target="_self">Publicaciones </a></span> &#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" nowrap class="menu_izq"><a href="../technology.htm" target="_self">Transferencia de tec. &amp; servicios </a>&#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top" class="menu_izq"><span class="menu_izq Estilo8"> <a href="../capabilities.htm">Capacidades &#13;</a><strong> <a href="capabilities.htm">&#13;&#13;</a></strong></span> &#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top"><a href="../difusion.htm" class="menu_izq"><strong>Difusi&oacute;n</strong></a></td>
        </tr>
        <tr>
          <td height="57">&nbsp;</td>
          <td width="84">&nbsp;</td>
          <td width="122">&nbsp;</td>
        </tr>
        <tr>
          <td height="84" colspan="3" valign="top"><img src="../imagenes/spacer_vert_84.gif" width="10" height="84"></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../sitemap.htm" target="_self">mapa del sitio</a> </div></td>
              <td rowspan="5" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita"><a href="../staff.htm" target="_self">staff</a></div></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../contact.htm" target="_self">contacto</a></div></td>
        </tr>
        <tr>
          <td height="16" colspan="2" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../../en/index.htm" target="_self">english version</a> </div></td>
        </tr>
        <tr>
          <td height="16"></td>
          <td></td>
        </tr>
		        <tr>
		          <td>&nbsp;</td>
                  <td>&nbsp;</td>
                  <td>&nbsp;</td>
        </tr>
		
                </table></td>
    <td width="40"></td>
    <td valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
        <td width="107"></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="titulo_principal_cap Estilo9"><span class="contenidos_titulos">GSPCA</span></td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="titulo_secundario"><span class="contenidos_titulos">(por </span>Andoni  Zubimendi<span class="contenidos_titulos">)</span>  - 18/Septiembre/2008 - <a href="20080917.htm"><strong>Permalink</strong></a> </td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td valign="top" class="parrafo_normal">
   <P class=contenidos>Meses  atr&aacute;s me hab&iacute;a decidido a comprar una webcam para casa.  Esto no tiene mucha dificultad a primera vista, salvo por el detalle  de ser un usuario de GNU/Linux, lo que hace que uno tenga que buscar  el hardware soportado con un poco m&aacute;s de detenimiento. 
   Busqu&eacute;  webcams soportadas por el n&uacute;cleo Linux, ya sea directamente o  por controladores de terceros, compar&eacute; con las que estaban  disponibles en el mercado y  finalmente  me  decid&iacute;  a   comprar una  webcam Genius VideoCam Look 300. Esta c&aacute;mara tiene soporte  oficial desde hace un tiempo en el n&uacute;cleo, y no tiene reportes  de fallos ni de calidad de imagen. Parec&iacute;a un candidato  perfecto.   
   <P class=contenidos> Compr&eacute;  la webcam, configur&eacute; y compil&eacute; el n&uacute;cleo,  enchufo la c&aacute;mara e inicio varios programas para probarla y  los resultados no fueron buenos, los colores se ve&iacute;an mal, el  controlador no maneja correctamente el led de encendido/apagado (y  probablemente la transmisi&oacute;n de datos). No era un buen  comienzo. Empiezo a buscar en profundidad sobre la webcam, reviso  foros, llego a la p&aacute;gina del autor del controlador y veo que  vende un controlador que dice que funciona bien y tiene mayor soporte  para aplicaciones, gente que tiene los mismos problemas (hace ya m&aacute;s  de un a&ntilde;o) y que todav&iacute;a no tiene soluci&oacute;n. Nada  buena la situaci&oacute;n. 
   <p ALIGN="JUSTIFY"> En  ese momento pens&eacute; en tres cosas: devuelvo la webcam (o se la  regalo a alguien), espero que se arregle el problema con el driver  (muy improbable ya que lleva mucho tiempo sin soluci&oacute;n) o  intento buscarle una soluci&oacute;n yo. Habiendo hecho las opciones  1 y 2 anteriormente con otros dispositivos, eleg&iacute; encarar y  tratar de encontrarle yo la soluci&oacute;n. Ahora ten&iacute;a que  investigar que opciones ten&iacute;a para poder solucionarlo. </p>
   <p ALIGN="JUSTIFY"> <strong>Las  opciones </strong> </p>
   <p ALIGN="JUSTIFY"> Investigando  encontr&eacute; estas opciones para poder hacer el desarrollo del  controlador de mi webcam: </p>
   <OL>
     <LI>
       <p ALIGN="JUSTIFY"> Corregir  	el controlador oficial.</p>
     <LI>
       <p ALIGN="JUSTIFY"> Escribir  	el controlador de nuevo, desde 0. </p>
     <LI>
       <p ALIGN="JUSTIFY"> Utilizar  	alg&uacute;n proyecto alternativo. </p>
     </OL>
   <p ALIGN="JUSTIFY">La  primera opci&oacute;n la descart&eacute; porque no me gusto la  actitud del autor, vi que no ten&iacute;a mucho contacto con otros  desarrolladores y que a todos los que ten&iacute;an problemas les  ped&iacute;a que usaran su controlador pago. Escribir todo de nuevo  era mucho para mi y quer&iacute;a aprovechar que existen proyectos  que soportaban c&aacute;maras similares a la mia. Los proyectos que  me parecieron m&aacute;s adecuados fueron: <A HREF="http://groups.google.com/group/microdia">microdia</A> y <A HREF="http://moinejf.free.fr/">GSPCA V4L v2</A>. </p>
   <p ALIGN="JUSTIFY">Los  dos proyectos soportan familias de webcams similares a las mias, de  estos dos me quede con el &uacute;ltimo ya que el primero por ahora  tiene soporte para modelos m&aacute;s actuales que mi webcam y GSPCA.</p>
   <p ALIGN="JUSTIFY"><strong>&iquest;Qu&eacute;  es GSPCA? </strong> </p>
   <p ALIGN="JUSTIFY">&ldquo;Generic  Software Package for Camera Adapters&rdquo; (GSPCA) es una reescritura y  limpieza del controlador SPCA5xx, que soporta m&aacute;s de 100  c&aacute;maras web. Desde el controlador original ha sufrido muchos  cambios y hoy en d&iacute;a es un framework para escribir  controladores de webcams USB, donde las cosas comunes a todos los  drivers como el manejo de las transferencias USB isocronicas, las  negociaciones de configuraci&oacute;n para las aplicaciones, la  administraci&oacute;n de buffers, locking, etc, est&aacute; a cargo  del componente b&aacute;sico de este controlador. Esto permite que  los componentes espec&iacute;ficos de cada controlador puedan  ocuparse de los detalles del bridge y el sensor que cada c&aacute;mara  posee sin tener que detenerse en los otros detalles. Los  controladores espec&iacute;ficos de los bridges se llaman  subcontroladores. </p>
   <p ALIGN="JUSTIFY"> Los  controladores de una webcam USB tienen 2 partes igualmente d&iacute;ficiles: </p>
   <OL>
     <LI>
       <p ALIGN="JUSTIFY"> Configuraci&oacute;n  	de mensajes USB, administraci&oacute;n de interrupciones,  	administraci&oacute;n de buffers entre el n&uacute;cleo y las  	aplicaciones, incluyendo sincronizaciones y permitir a multiples  	aplicaones utilizar la webcam al mismo tiempo. Manejo de  	conexi&oacute;n/desconexi&oacute;n en caliente.</p>
     <LI>
       <p ALIGN="JUSTIFY"> Saber  	que hay que mandarle a la webcam para que empiece a mandar datos y  	como procesar los datos recibidos. </p>
     </OL>
   <p ALIGN="JUSTIFY">El  primer punto es algo que es com&uacute;n a todas las webcams USB que  no sean UVC (USB Video Class, est&aacute;ndar para dispositivos con  capacidades de streaming de video, relativamente nuevo) y es lo que  resuelve el n&uacute;cleo del controlador GSPCA, evitando la  duplicaci&oacute;n de c&oacute;digo y reduciendo la posibilidad de  errores. </p>
   <p ALIGN="JUSTIFY"><strong>&iquest;Qu&eacute;  hay que hacer?</strong></p>
   <p ALIGN="JUSTIFY">Las  webcams USB normalmente tienen 2 partes bien diferenciadas y que  cumplen funciones especificas, la primera parte es el bridge, que se  conecta directamente al bus USB y se conecta al sensor, responsable  de la captura del flujo de video. Es com&uacute;n que las bridges  est&eacute;n conectados por un bus I2C al sensor. </p>
   <p ALIGN="JUSTIFY"> Hacer  que una webcam funcione correctamente implica: </p>
   <OL>
     <LI>
       <p ALIGN="JUSTIFY"> Identificar  	el bridge y sensor de la webcam.</p>
     <LI>
       <p ALIGN="JUSTIFY"> Configurar  	el bridge, para que nos transfiera datos a trav&eacute;s del bus USB  	cuando lo necesitemos. </p>
     <LI>
       <p ALIGN="JUSTIFY"> Configurar  	el sensor, para obtener un flujo correcto de imagen. </p>
     <LI>
       <p ALIGN="JUSTIFY"> Interpretar  	la informaci&oacute;n recibida para poder recibir los diferentes  	cuadros. </p>
       </OL>
   <p ALIGN="JUSTIFY"> &iquest;C&oacute;mo  podemos hacer para saber todo esto? En algunos casos y si hay suerte,  se puede contar con las hojas de datos de los bridges y/o sensores.  Otra fuente com&uacute;n es la de otros drivers que tengan soporte  para hardware similar. Pero la fuente de informaci&oacute;n m&aacute;s  com&uacute;n para empezar suele ser la obtenida a partir de los  controladores provistos por el fabricante para Windows, tanto los  archivos de instalaci&oacute;n (los archivos *.inf suelen identificar  el bridge/sensor de una webcam) como del controlador funcionando. </p>
   <p ALIGN="JUSTIFY"> Existen  herramientas que nos permiten capturar el tr&aacute;fico USB que  existe entre la PC y cierto dispositivo y luego analizarlo. Buscando  en la documentaci&oacute;n de los proyectos se pueden encontrar  tutoriales muy f&aacute;ciles de seguir que explican como hacerlo.  Tambi&eacute;n proveen herramientas para procesar la informaci&oacute;n  obtenida y hasta para generar c&oacute;digo. </p>
   <p ALIGN="JUSTIFY"><strong>Manos  a la obra </strong> </p>
   <p ALIGN="JUSTIFY">Habiendo  recopilado toda la informaci&oacute;n sobre mi webcam, incluyendo  capturas de las comunicaciones en Windows, empece a a trabajar. Ya  ten&iacute;a identificados el bridge y el sensor de mi webcam. El  primer punto ya estaba completo. Hasta consegu&iacute; la hoja de  datos del sensor de mi webcam. </p>
   <p ALIGN="JUSTIFY"> El  primer paso fue lograr un flujo de imagen constante, fue lo que m&aacute;s  trabajo cost&oacute; ya que el bridge existente en mi webcam no  estaba soportado en el subcontrolador y requer&iacute;a un  tratamiento diferente al resto de los bridges. En este punto, las  capturas del tr&aacute;fico fueron fundamentales. Tras un par de  semanas de intercambio de pruebas, opiniones, consejos y busquedas en  internet, el segundo y el cuarto paso ya estaban completos. La webcam  mostraba un flujo de imagen continuo. </p>
   <p ALIGN="JUSTIFY"> Quedaba  configurar el sensor, esta parte fue un poco m&aacute;s f&aacute;cil,  ya que al apoyo de las capturas, se sumaba la hoja de datos y pod&iacute;a  entender claramente que implicaba cada configuraci&oacute;n. </p>
   <p ALIGN="JUSTIFY"> En  poco tiempo la webcam ya estaba funcionando. No solo estaba haciendo  funcionar mi webcam sino aprendiendo como utilizar el framework  GSPCA, n&uacute;cleo, el bus USB, I2C y conceptos b&aacute;sicos de  fotograf&iacute;a/video. </p>
   <p ALIGN="JUSTIFY"> Quiero  decir que todo esto fue posible gracias a la ayuda y consejo de  Jean-Fran&ccedil;ois Moine  y Hans de Geode (a cargo de varios  subdrivers de GSPCA). Jean-Fran&ccedil;ois Moine es un desarrollador  aficionado frances que realiz&oacute; la  reescritura del c&oacute;digo   original  adaptandolo  a  la  &uacute;ltima  versi&oacute;n  del   est&aacute;ndar Video4Linux.  Hans de Geode es un hacker Holandes con cerca de 5 a&ntilde;os de  experiencia en el n&uacute;cleo Linux, trabaja principalmente en el  proyecto Fedora y actualmente esta a cargo de un proyecto para  mejorar la experiencia de usuario en esa distribuci&oacute;n de  GNU/Linux con respecto a las <A HREF="http://fedoraproject.org/wiki/Features/BetterWebcamSupport">Webcams</A>.</p>
   <p ALIGN="JUSTIFY"> Para  terminar, quer&iacute;a comentar que al estar realizando los ajustes  finales al controlador y estando ya soportada mi webcam en GSPCA, me  enter&eacute; que este hab&iacute;a sido enviado al n&uacute;cleo  para su inclusi&oacute;n en la versi&oacute;n 2.6.27. Es una  satisfacci&oacute;n haber podido hacer andar mi webcam, pero me  reconforta m&aacute;s colaborar con mi peque&ntilde;o aporte para que  algunas personas puedan utilizar su webcam en GNU/Linux sin mayores  inconvenientes. </p>
   <p ALIGN="JUSTIFY">&nbsp;</p>
   <p ALIGN="JUSTIFY"> <strong>Referencias: </strong> </p>
   <UL>
     <LI>
       <p ALIGN="JUSTIFY"> Proyecto  	GSPCA v2 y p&aacute;gina personal de Jean-Fran&ccedil;ois Moine: <A HREF="http://moinejf.free.fr/">http://moinejf.free.fr/</A></p>
     <LI>
       <p ALIGN="JUSTIFY"> Proyecto  	SPCA5xx y GSPCA original: <A HREF="http://mxhaard.free.fr/spca5xx.html%20">http://mxhaard.free.fr/spca5xx.html </A> </p>
     <LI>
       <p ALIGN="JUSTIFY"> Proyecto  	Microdia: <A HREF="http://groups.google.com/group/microdia/">http://groups.google.com/group/microdia/</A> </p>
     <LI>
       <p ALIGN="JUSTIFY"> Blog  	personal de Hans de Goede: <A HREF="http://hansdegoede.livejournal.com/">http://hansdegoede.livejournal.com/</A></p>
     </UL>
   <p ALIGN="JUSTIFY">&nbsp;</p></td>
<td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td width="386"></td>
    <td></td>
  </tr>
  <tr>
    <td colspan="2" valign="top"><div align="left">
            <p>&nbsp;</p>
            <p><a href="../feed.xml" target="_blank">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img border=0 src="../imagenes/rss.png"></a></p>
          </div></td>
    <td>&nbsp;</td>
    <td>&nbsp;</td>
    <td></td>
  </tr>
  <tr>
    <td colspan="4" valign="top" class="menu_pie"><a href="about_us.htm" target="_self"> sobre nosotros</a> <span class="secciones">| <a href="research.htm" target="_self">investigaci&oacute;n</a> |</span> <a href="publications.htm" target="_self">publicaciones</a> <span class="secciones">|</span> <a href="technology.htm" target="_self">transferencia de t.</a> <span class="secciones">|</span> <a href="capabilities.htm" target="_self">capacidades</a> </td>
  </tr>
  <tr>
    <td colspan="6" valign="bottom" nowrap><img src="../imagenes/barra_down.gif" width="830" height="43" border="0" usemap="#Map"></td>
  </tr>
</table>
<map name="Map">
  <area shape="rect" coords="609,-31,743,22" href="http://www.amplioespectro.com" target="_blank">
</map>
</body>
</html>

<!-- Localized -->