<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Lifia</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="shortcut icon" href="imagenes/lifiaicon.ico" >
<style type="text/css">
<!--
@import url(estilos_lifia.css);
body {
	background-color: #FFFFFF;
	margin-left: 0px;
	margin-top: 5px;
	margin-right: 0px;
	margin-bottom: 0px;
	background-image: url();
}
a:link {
	text-decoration: none;
}
a:visited {
	text-decoration: none;
}
a:hover {
	text-decoration: none;
}
a:active {
	text-decoration: none;
}
.Estilo4 {color: #666666}
.Estilo8 {color: #1EA173}
body,td,th {
	color: #000000;
}
-->
</style>
<link href="printable_version.css" rel="stylesheet" type="text/css">
</head>

<body>
<table width="460" border="0" align="center" cellpadding="0" cellspacing="0" class="texto_negro">
  <!--DWLayoutTable-->
  <tr>
    <td height="179" colspan="2" valign="top"><img src="imagenes/top_about_laser.gif" width="460" height="179"></td>
  </tr>
  <tr>
    <td width="50" height="358" valign="top"><img src="imagenes/spacer_blanco.gif" width="50" height="49"></td>
    <td width="410" valign="top" class="texto_negro"><span class="titulo_negro">Filosof&iacute;a </span><br>      <br>
      El LIFIA es un laboratorio de investigaci&oacute;n que ofrece a la comunidad acad&eacute;mica y a la industria, tanto nacionales como internacionales, sus servicios y conocimientos relacionados con Tecnolog&iacute;as de la Informaci&oacute;n.
		  <br>
          Fundado en 1988 en la Facultad de Ciencias Exactas de la Universidad Nacional de La Plata, Argentina; la capacidad del LIFIA para concebir, dise&ntilde;ar y desarrollar sistemas de informaci&oacute;n ha sido ampliamente reconocida.<br>
      <br>
      <br>
      <span class="subtitulos_negros">Objetivos</span><br>
      <p class="subtitulos_negros">        Desarrollar investigaci&oacute;n b&aacute;sica y aplicada  de excelencia en diferentes &aacute;reas de las ciencias y tecnolog&iacute;as de la informaci&oacute;n.</p>
      <p class="texto_negro">El LIFIA promueve principalmente el desarrollo de l&iacute;neas y proyectos de investigaci&oacute;n cient&iacute;fica y tecnol&oacute;gica que sean originales y de buen nivel y que fundamentalmente aporten efectivamente al desarrollo de m&eacute;todos, t&eacute;cnicas y productos en el &aacute;rea de las TIs y que puedan ser transferidos a la industria local o internacional.</p>
      <p class="subtitulos_negros">Formar recursos humanos de excelencia para la investigaci&oacute;n y el desarrollo de las TIs </p>
      <p class="texto_negro">Los miembros del LIFIA son docentes, investigadores, profesionales y estudiantes universitarios con amplia experiencia en investigaci&oacute;n, desarrollo, implementaci&oacute;n y capacitaci&oacute;n en TIs.</p>
      <p class="subtitulos_negros">Transferir tecnolog&iacute;a y conocimientos en TIs a la industria y a la sociedad en general </p>
      <p class="texto_negro">  &bull; EL LIFIA promover&aacute; la aplicaci&oacute;n de los resultados de sus investigaciones y la participaci&oacute;n de sus miembros en la soluci&oacute;n de problemas reales de inter&eacute;s tecnol&oacute;gico en el &aacute;mbito de la industria de las TIs en el medio local e internacional. <br>
  &bull; El LIFIA promover&aacute; la innovaci&oacute;n productiva a trav&eacute;s de la aplicaci&oacute;n de m&eacute;todos, t&eacute;cnicas y herramientas del mejor nivel en la soluci&oacute;n de problemas reales de la industria y de la sociedad argentina y del exterior. </p></td>
  </tr>
</table>
</body>
</html>

<!-- Localized -->