<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Lifia</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="shortcut icon" href="imagenes/lifiaicon.ico" >
<style type="text/css">
<!--
@import url(estilos_lifia.css);
body {
	background-color: #FFFFFF;
	margin-left: 0px;
	margin-top: 5px;
	margin-right: 0px;
	margin-bottom: 0px;
	background-image: url();
}
a:link {
	text-decoration: none;
}
a:visited {
	text-decoration: none;
}
a:hover {
	text-decoration: none;
}
a:active {
	text-decoration: none;
}
.Estilo4 {color: #666666}
.Estilo8 {color: #1EA173}
body,td,th {
	color: #000000;
}
-->
</style>
<link href="printable_version.css" rel="stylesheet" type="text/css">
</head>

<body>
<table width="460" border="0" align="center" cellpadding="0" cellspacing="0" class="texto_negro">
  <!--DWLayoutTable-->
  <tr>
    <td height="179" colspan="2" valign="top"><img src="imagenes/top_capabilities_laser.gif" width="460" height="179"></td>
  </tr>
  <tr>
    <td width="50" rowspan="2" valign="top"><img src="imagenes/spacer_blanco.gif" width="50" height="49"></td>
    <td width="410" height="58" valign="top"><img src="imagenes/capabilities_brief_bw.gif" width="386" height="58" align="left"></td>
  </tr>
  <tr>
    <td height="404" valign="top" class="texto_negro"><span class="titulo_negro">Desarrollo Web </span><br>      <br>
Utilizamos m&eacute;todos precisos de ingenier&iacute;a de software para desarrollar sistemas aprovechando Internet para integrar aplicaciones e informaci&oacute;n estrat&eacute;gicas, tanto en &aacute;reas tradicionales como en desarrollos para equipos m&oacute;viles, comercio electr&oacute;nico y educaci&oacute;n a distancia. <br>

<br>
<span class="titulo_negro">Sistemas distribuidos y m&oacute;viles</span> <br><br>
El desarollo de soluciones para sistemas distribuidos requiere una visi&oacute;n arquitectural completa a fin de garantizar aspectos de calidad como alta performance, robustez y flexibilidad, dentro de un marco tecnol&oacute;gico que evoluciona constantemente. La adopci&oacute;n de dispositivos m&oacute;viles impone nuevos requerimientos para los sistemas desarrollados en N-capas ya que la ubicaci&oacute;n f&iacute;sica del usuario juega un papel preponderante.<br>
<br>

<span class="titulo_negro">Sistemas colaborativos </span><br>
<br>
Las Aplicaciones Groupware son sistemas que permiten a un grupo de usuarios comunicarse y trabajar en forma colaborativa. Esto implica que el grupo de usuarios pueda coordinar actividades, solucionar problemas, editar documentos o diagramas, negociar, etc., usando tecnolog&iacute;as espec&iacute;ficas generalmente basadas en servicios electr&oacute;nicos de redes tales como el env&iacute;o de mails, video-conferencia, chat, etc.<br>
<br><span class="titulo_negro">Sistemas de Informaci&oacute;n Geogr&aacute;fica</span><br>
<br>
Los Sistemas de Informaci&oacute;n Geogr&aacute;fica (S.I.G) son utilizados para recolectar, analizar y presentar informaci&oacute;n que describe propiedades f&iacute;sicas y l&oacute;gicas del mundo real. Hoy en d&iacute;a, m&uacute;ltiples &aacute;reas de la ciencia utilizan esta tecnolog&iacute;a, hecho que agrega un nivel extra de dificultad al diseñar soluciones flexibles.</td>
  </tr>
</table>
</body>
</html>

<!-- Localized -->