<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Lifia</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="shortcut icon" href="imagenes/lifiaicon.ico" >
<style type="text/css">
<!--
@import url("estilos_lifia.css");
body {
	background-color: #FFFFFF;
	margin-left: 0px;
	margin-top: 5px;
	margin-right: 0px;
	margin-bottom: 0px;
	background-image: url();
}
a:link {
	text-decoration: none;
}
a:visited {
	text-decoration: none;
}
a:hover {
	text-decoration: none;
}
a:active {
	text-decoration: none;
}
.Estilo4 {color: #666666}
.Estilo8 {color: #1EA173}
body,td,th {
	color: #000000;
}
-->
</style>
<link href="printable_version.css" rel="stylesheet" type="text/css">
</head>

<body>
<table width="460" border="0" align="center" cellpadding="0" cellspacing="0">
  <!--DWLayoutTable-->
  <tr>
    <td height="179" colspan="2" valign="top"><img src="imagenes/top_capabilities_laser.gif" width="460" height="179"></td>
  </tr>
  <tr>
    <td width="50" rowspan="2" valign="top"><img src="imagenes/spacer_blanco.gif" width="50" height="49"></td>
    <td width="410" height="459" valign="top" class="texto_negro"><span class="titulo_negro">Sistemas colaborativos </span><br>      <br>
      Aplicaciones Groupware son sistemas que permiten a un grupo de usuarios comunicarse y trabajar en forma colaborativa. Esto implica que el grupo de usuarios pueda coordinar actividades, solucionar problemas, editar documentos o diagramas, negociar, etc., usando tecnolog&iacute;as espec&iacute;ficas generalmente basadas en servicios electr&oacute;nicos de redes tales como el env&iacute;o de mails, video-conferencia, chat, etc. <br>
            Con la popularidad ganada por Internet en los &uacute;ltimos a&ntilde;os, millones de usuarios hoy se conectan para trabajar, aprender, entretenerse o simplemente comunicarse. Incluso, numerosas organizaciones incorporan la tecnolog&iacute;a groupware como una nueva herramienta de trabajo cooperativo de acuerdo a sus necesidades y caracter&iacute;sticas. Esta nueva realidad requiere herramientas, ambientes y metodolog&iacute;as que permitan que estos usuarios colaboren para efectuar sus actividades. <br>
          Los ambientes colaborativos hacen posible que estos usuarios realicen sus actividades en forma conjunta con diferentes modalidades. Las colaboraciones, como se muestra en el siguiente cuadro, se distinguen por el momento en que se realizan (sincr&oacute;nicas y asincr&oacute;nicas) y por el lugar donde se encuentran los participantes (cara a cara y a distancia).<br>		  <br>
      <span class="subtitulos_negros">Experiencia del LIFIA </span><br>
      Diferentes proyectos ejecutados exitosamente tanto a nivel nacional como internacional y un conocimiento s&oacute;lido de los avances cient&iacute;ficos en el &aacute;rea nos permiten llevar adelante proyectos complejos relacionados con sistemas groupware y configuraciones de trabajo colaborativo.<br>      <br>
      <span class="subtitulos_negros">Servicios ofrecidos por el LIFIA </span>      <br>
      Desarrollo de soluciones: <br>
      El LIFIA es capaz de desarrollar proyectos completos relacionados con groupware y CSCW, desde las etapas tempranas de especificaci&oacute;n de requerimientos hasta las etapas de implementaci&oacute;n, posterior puesta en producci&oacute;n. Los desarrollos pueden realizarse en casa del Cliente o en nuestra oficinas.<br>      <br>
      <span class="texto_negro">Capacitaci&oacute;n corporativa:</span> <br>
    El LIFIA cuenta con profesionales altamente capacitados que dictan cursos de capacitaci&oacute;n en casa de Cliente o en nuestras oficinas sobre productos o metodolog&iacute;as de trabajo relacionados con groupware y CSCW.<br>
  El calendario usualmente se establece de com&uacute;n acuerdo entre el LIFIA y el Cliente.</td>
  </tr>
  <tr>
    <td height="28">&nbsp;</td>
  </tr>
</table>
</body>
</html>

<!-- Localized -->