<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Lifia</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="shortcut icon" href="imagenes/lifiaicon.ico" >
<style type="text/css">
<!--
@import url("estilos_lifia.css");
body {
	background-color: #bec2d1;
	margin-left: 0px;
	margin-top: 5px;
	margin-right: 0px;
	margin-bottom: 0px;
	background-image: url();
}
a:link {
	color: #255282;
	text-decoration: none;
}
a:visited {
	text-decoration: none;
	color: #255282;
}
a:hover {
	text-decoration: none;
	color: #FF9933;
}
a:active {
	text-decoration: none;
	color: #FF9933;
}
.Estilo4 {color: #666666}
.Estilo7 {font-size: 10px; font-style: normal; font-weight: normal; text-align: justify; text-indent: 10pt; white-space: normal; font-family: Verdana, Arial, Helvetica, sans-serif;}
-->
</style></head>

<body>
<table width="830" border="0" align="center" cellpadding="0" cellspacing="0" background="imagenes/line_830.gif">
  <!--DWLayoutTable-->
  <tr>
    <td width="30" rowspan="15" valign="top"><img src="imagenes/spacer_izq2.gif" width="30" height="615"></td>
    <td colspan="5" valign="top"><table width="780" height="114" border="0" cellpadding="0" cellspacing="0">
        <!--DWLayoutTable-->
        <tr>
          <td width="780" height="170" valign="top"><img src="imagenes/top_research2.gif" width="780" height="172" border="0" usemap="#Map"></td>
        </tr>
    </table></td>
  <td width="22" rowspan="15" valign="top"><img src="imagenes/spacer_der2.gif" width="20" height="485"></td>
  </tr>
  <tr>
    <td width="247" rowspan="11" valign="top"><table width="247" border="0" cellpadding="0" cellspacing="0">
        <!--DWLayoutTable-->
        <tr>
          <td height="19" colspan="5" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
        </tr>
        <tr>
          <td width="41" height="19" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
                    <td colspan="3" valign="top"><span class="menu_izq"> <a href="index.htm" target="_self">Bienvenida</a> </span></td>
                    <td width="9" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
        </tr>
        <tr>
          <td height="19" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
          <td colspan="3" valign="top" class="menu_izq"> <a href="about_us.htm" target="_self">Sobre nosotros</a> </td>
          <td valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
        </tr>
        <tr>
          <td height="19" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
          <td colspan="3" valign="top" class="menu_izq"><a href="research.htm" target="_self"><strong>Investigaci&oacute;n</strong></a></td>
          <td valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
                    <td colspan="3" valign="top" class="menu_izq"><span class="menu_izq"><a href="cscw.htm" target="_self">Ambientes colaborativos y groupware </a></span></td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
          <td colspan="3" valign="top" class="menu_izq"> <a href="formal.htm" target="_self">Teor&iacute;a y m&eacute;todos formales</a> </td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
          <td colspan="3" valign="top" class="menu_izq"> <a href="w_e.htm" target="_self">Ingenier&iacute;a web</a></td>
        </tr>
        <tr>
          <td height="19" colspan="2" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
          <td colspan="3" valign="top" class="menu_izq"><div align="left"> <a href="gis_mob.htm" target="_self">SIG y computaci&oacute;n m&oacute;vil</a><strong><BR>
          </strong></div></td>
        </tr>
        <tr>
          <td height="0"></td>
          <td width="17"></td>
          <td width="67"></td>
          <td width="113"></td>
          <td></td>
        </tr>
        <tr>
          <td rowspan="3" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
          <td height="19" colspan="4" valign="top" class="menu_izq"><a href="publications.htm" target="_self">Publicaciones</a></td>
        </tr>
        <tr>
          <td height="19" colspan="4" valign="top" class="menu_izq"><span class="menu_izq"> <a href="technology.htm" target="_self">Transferencia de tec. &amp; servicios  </a></span> &#13;</td>
        </tr>
        <tr>
          <td height="19" colspan="4" valign="top" class="menu_izq"><span class="menu_izq"> <a href="capabilities.htm" target="_self">Capacidades</a><strong>&#13;</strong></span> &#13;</td>
        </tr>
         <tr>
          <td height="19" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
          <td colspan="3" valign="top" class="menu_izq"><a href="difusion.htm">Difusi&oacute;n</a></td>
        </tr>
        <tr>
          <td height="19" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
          <td colspan="3" valign="top" class="menu_izq"><a href="../pdfs/brochure_def1.pdf" > <span class="titles_der_project" >Memorias del LIFIA 2000-2007</span></a></td>
        </tr>
        <tr>
          <td height="84" colspan="5" valign="top"><img src="imagenes/spacer_vert_84.gif" width="10" height="84"></td>
        </tr>
        <tr>
          <td height="19" colspan="3" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="sitemap.htm" target="_self">mapa del sitio</a> </div></td>
          <td colspan="2" rowspan="5" valign="top"><!--DWLayoutEmptyCell-->&nbsp;</td>
        </tr>
        <tr>
          <td height="16" colspan="3" valign="top"><div align="center" class="menu_negrita"><a href="staff.htm" target="_self">staff</a></div></td>
        </tr>
        <tr>
          <td height="16" colspan="3" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="contact.htm" target="_self">contacto</a></div></td>
        </tr>
        <tr>
          <td height="16" colspan="3" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="../en/index.htm" target="_self">english version</a> </div></td>
        </tr>
        <tr>
          <td height="16" colspan="3" valign="top"><div align="center" class="menu_negrita Estilo4"><a href="research_p.htm" target="_blank">version imprimible</a> </div></td>
        </tr>
    </table></td>
    <td width="41">&nbsp;</td>
    <td colspan="2" valign="top" class="volanta"><!--DWLayoutEmptyCell-->&nbsp;</td>
                <td width="106"></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td colspan="2" valign="top" class="titulo_principal">Desarrollo de software dirigido por modelos: teor&iacute;as, metodolog&iacute;as y herramientas </td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td colspan="2" valign="top" class="titles_der"> Objetivos</td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td colspan="2" valign="top" class="parrafo_normal">El objetivo general de este proyecto es contribuir al mejoramiento de los procesos de desarrollo de software, a trav&eacute;s del an&aacute;lisis del paradigma de desarrollo conocido como MDD (Model Driven Development) integrado con la aplicaci&oacute;n de m&eacute;todos formales  y soportados por herramientas autom&aacute;ticas.<br>
  El problema es abordado a trav&eacute;s de los siguientes sub-objetivos espec&iacute;ficos:<br>
  An&aacute;lisis conceptual de las t&eacute;cnicas de modelado de software.<br>
  Estudio, elaboraci&oacute;n y formalizaci&oacute;n de lenguajes para crear modelos de software.<br>
  Catalogaci&oacute;n y formalizaci&oacute;n de mecanismos de transformaci&oacute;n entre modelos.<br>
  Definici&oacute;n y formalizaci&oacute;n de lenguajes para describir transformaciones.<br>
  Implementaci&oacute;n de herramientas de software autom&aacute;ticas.</td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td colspan="2" valign="top" class="titles_der">Contexto</td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td colspan="2" valign="top" class="parrafo_normal">	El paradigma <strong>MDD</strong> tiene dos ejes principales: <br>
	- por un lado hace &eacute;nfasis en la separaci&oacute;n entre la especificaci&oacute;n de la funcionalidad esencial del sistema y la implementaci&oacute;n de dicha funcionalidad usando plataformas tecnol&oacute;gicas espec&iacute;ficas. Para ello, el <strong>MDD</strong> identifica dos tipos principales de modelos: modelos con alto nivel de abstracci&oacute;n e independientes de cualquier tecnolog&iacute;a de implementaci&oacute;n, llamados <strong>PIM</strong> (Platform Independent Model) y modelos que especifican el sistema en t&eacute;rminos de construcciones de implementaci&oacute;n disponibles en alguna tecnolog&iacute;a espec&iacute;fica, conocidos como <strong>PSM</strong> (Platform Specific Model); <br>
	- por otro lado, los modelos son considerados los conductores primarios en todos los aspectos del desarrollo de software. Un PIM es transformado en uno o mas <strong>PSMs</strong>, es decir que para cada plataforma tecnol&oacute;gica espec&iacute;fica se genera un PSM especifico. La transformaci&oacute;n entre modelos constituye el motor del <strong>MDD</strong> y de esta manera los modelos pasan de ser entidades meramente contemplativas a ser entidades productivas. <br>
	La iniciativa <strong>MDD</strong> cubre un amplio espectro de &aacute;reas de investigaci&oacute;n: lenguajes para la descripci&oacute;n de modelos, definici&oacute;n de lenguajes de transformaci&oacute;n entre modelos, construcci&oacute;n de herramientas de soporte a las distintas tareas involucradas, aplicaci&oacute;n de los conceptos en m&eacute;todos de desarrollo y en dominios espec&iacute;ficos, etc. <br>
	Actualmente, algunos de estos aspectos est&aacute;n bien fundamentados y se est&aacute;n empezando a aplicar con &eacute;xito, otros sin embargo est&aacute;n todav&iacute;a en proceso de definici&oacute;n. En este contexto son necesarios esfuerzos que conviertan <strong>MDD</strong> y sus conceptos y t&eacute;cnicas relacionados en una aproximaci&oacute;n coherente, basada en est&aacute;ndares abiertos y soportada por t&eacute;cnicas y herramientas maduras.</span></td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td colspan="2" valign="top" class="titles_der">Relevancia del Tema</td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td colspan="2" valign="top" class="parrafo_normal">La aplicaci&oacute;n de <strong>MDD</strong> contribuye a mejorar el proceso de desarrollo de software en los siguientes aspectos:<br>
  Productividad: el desarrollo de software basado en modelos mejora la productividad global del proyecto. Se observa que las primeras fases del proceso son menos productivas respecto a otras metodolog&iacute;as (por ejemplo XP), sin embargo esto es compensado en las etapas posteriores, especialmente en la etapa de mantenimiento, ya que introducir modificaciones sobre los modelos es mucho mas r&aacute;pido y f&aacute;cil que hacerlo sobre el c&oacute;digo.<br>
  Portabilidad: en la industria del software surgen nuevas tecnolog&iacute;as cada a&ntilde;o. En general resulta necesario y/o conveniente adaptar el software existente a dichos cambios tecnol&oacute;gicos. <strong>MDD</strong> facilita la portabilidad ya que los modelos son independientes de cualquier tecnolog&iacute;a, es decir que el mismo <strong>PIM</strong> puede ser transformado autom&aacute;ticamente en m&uacute;ltiples PSMs para diferentes plataformas.<br>
  Reuso: los modelos abstractos de un sistema de software ofrecen una posibilidad m&aacute;s amplia de reuso. A partir de un modelo es posible derivar toda una familia de sistemas concretos para usos espec&iacute;ficos, y utilizando diferentes tecnolog&iacute;as especificas.<br>
  Interoperabilidad: la mayor&iacute;a de los sistemas de software se comunican con otros sistemas de software. T&iacute;picamente estos sistemas est&aacute;n implementados con diferentes tecnolog&iacute;as. <strong>MDD</strong> favorece la interoperabilidad entre sistemas heterog&eacute;neos, ya que permite la especificaci&oacute;n de las conexiones entre las distintas tecnolog&iacute;as.<br></td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td colspan="2" valign="top" class="titles_der">Estado del Arte&nbsp;</td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td colspan="2" valign="top" class="parrafo_normal">A continuaci&oacute;n se describen los principales avances en cada faceta del <strong>MDD</strong>:<br>
  Modelos y Lenguajes de modelado: el Object Management Group (OMG) ha definido lenguajes de modelado adecuados para especificar <strong>PIMs</strong> y <strong>PSMs</strong>. El m&aacute;s conocido y usado es el Unified Modeling Language (<strong>UML</strong>), acompa&ntilde;ado por el Object Constraint Language (<strong>OCL</strong>) que es un lenguaje de consulta para <strong>UML</strong>. <strong>UML</strong> es un lenguaje muy expresivo que permite la creaci&oacute;n de distintas modelos del sistema desde diferentes puntos de vista y diferentes niveles de abstracci&oacute;n. <strong>UML</strong> provee adicionalmente mecanismos de extensi&oacute;n llamados profiles que nos permiten definir lenguajes derivados de <strong>UML</strong>. Lenguajes definidos mediante profiles son adecuados para crear modelos en dominios espec&iacute;ficos. Varios profiles han sido estandarizados por el <strong>OMG</strong>, por ejemplo profiles para Enterprise Java Beans (<strong>EJB</strong>), <strong>NET</strong>, <strong>COM</strong> y <strong>CORBA</strong> entre otros. Profiles generalmente se utilizan para defiir PSMs. Por otra parte, para que los modelos puedan ser manipulados autom&aacute;ticamente es necesario que los lenguajes de modelado est&eacute;n formalmente definidos; por ello, el <strong>OMG</strong> tiene un lenguaje especial llamado Meta Object Facility (<strong>MOF</strong>) que se utiliza para definir formalmente a todos los otros lenguajes de modelado.<br>
  Transformaci&oacute;n de modelos: el OMG esta actualmente trabajando en la definici&oacute;n de un lenguaje est&aacute;ndar para describir transformaciones. Este est&aacute;ndar es conocido como <strong>QVT</strong>, que quiere decir Query, View and Transformations y se encuentra en proceso de estandarizaci&oacute;n.<br>
  Herramientas autom&aacute;ticas: actualmente existen herramientas que combinan algunas de las funciones requeridas. Estas funciones pueden ser espec&iacute;ficas para un lenguaje o pueden ser gen&eacute;ricas. Una herramienta especifica puede por ejemplo proveer un editor de modelos UML y generar c&oacute;digo C# a partir de los diagramas UML. Un editor gen&eacute;rico puede permitirle al usuario elegir un lenguaje de modelado de un cat&aacute;logo y hasta permitirle crear su propio lenguaje de modelado. Una lista bastante completa de herramientas puede encontrarse en la p&aacute;gina de OMG sobre <a href="http://www.omg.org/mda/committed-products.htm">MDA</a>. <br>
  Aplicaci&oacute;n de m&eacute;todos formales al <strong>MDD</strong>: acompa&ntilde;ando a las actividades de estandarizaci&oacute;n de lenguajes y procesos coordinadas por el <strong>OMG</strong>, las cuales tienen un enfoque b&aacute;sicamente &ldquo;pragm&aacute;tico&rdquo;, existe una bien organizada comunidad cient&iacute;fica, de la cual los integrantes de este proyecto forman parte, abocada al an&aacute;lisis de los elementos del <strong>MDD</strong> desde la perspectiva cient&iacute;fica.&nbsp;</td>
    <td></td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td width="315" rowspan="2" valign="top" class="titulo_principal"><!--DWLayoutEmptyCell-->&nbsp;</td>
    <td width="71" rowspan="2" valign="top"><a href="gis_mob.htm" target="_self"></a></td>
    <td></td>
  </tr>
  
  
  <tr>
    <td></td>
    <td></td>
    <td></td>
  </tr>
  <tr>
    <td></td>
    <td></td>
    <td></td>
    <td></td>
    <td></td>
  </tr>
  
  
  <tr>
    <td colspan="5" valign="top" class="menu_pie"><a href="about_us.htm" target="_self"> sobre nosotros</a> <span class="secciones">| <a href="research.htm" target="_self">investigaci&oacute;n</a> |</span> <a href="publications.htm" target="_self">publicaciones</a> <span class="secciones">|</span> <a href="technology.htm" target="_self">transferencia de t.</a> <span class="secciones">|</span> <a href="capabilities.htm" target="_self">capacidades</a> </td>
  </tr>
  <tr>
    <td colspan="7" valign="bottom" nowrap><img src="imagenes/barra_down.gif" width="830" height="43" border="0" usemap="#Map"></td>
  </tr>
</table>
<map name="Map">
  <area shape="rect" coords="609,-25,742,24" href="http://www.amplioespectro.com" target="_blank">
</map>
</body>
</html>

<!-- Localized -->