<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Lifia</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="shortcut icon" href="imagenes/lifiaicon.ico" >
<style type="text/css">
<!--
@import url(estilos_lifia.css);
body {
	background-color: #FFFFFF;
	margin-left: 0px;
	margin-top: 5px;
	margin-right: 0px;
	margin-bottom: 0px;
	background-image: url();
}
a:link {
	text-decoration: none;
}
a:visited {
	text-decoration: none;
}
a:hover {
	text-decoration: none;
}
a:active {
	text-decoration: none;
}
.Estilo4 {color: #666666}
.Estilo8 {color: #1EA173}
body,td,th {
	color: #000000;
}
-->
</style>
<link href="printable_version.css" rel="stylesheet" type="text/css">
</head>

<body>
<table width="460" border="0" align="center" cellpadding="0" cellspacing="0" class="texto_negro">
  <!--DWLayoutTable-->
  <tr>
    <td height="179" colspan="2" valign="top"><img src="imagenes/top_research_laser.gif" width="460" height="179"></td>
  </tr>
  <tr>
    <td width="50" rowspan="3" valign="top"><img src="imagenes/spacer_blanco.gif" width="50" height="49"></td>
    <td width="410" height="58" valign="top"><img src="imagenes/research_brief_bw.gif" width="386" height="58" align="left"></td>
  </tr>
  <tr>
    <td height="445" valign="top" class="texto_negro">      <p><span class="titulo_negro">Ambientes colaborativos y Groupware </span><br>
      <br>
      Nuestro trabajo en esta &aacute;rea afronta los desaf&iacute;os propios de la concepci&oacute;n y desarrollo de soluciones innovadoras para el aprendizaje y trabajo en forma colaborativa. A tal fin se consideran aspectos tales como awareness y tailoring aplicando t&eacute;cnicas y tecnolog&iacute;as tales como redes de pares y web sem&aacute;ntica. Los resultados toman la forma de herramientas de colaboraci&oacute;n innovadoras, m&eacute;todos de colaboraci&oacute;n as&iacute; como metodlog&iacute;as para el dise&ntilde;o y desarrollo.  <br>
      <br>
      <br>
      <span class="titulo_negro">Teor&iacute;a y m&eacute;todos formales </span><br>
      <br>
        La investigaci&oacute;n del grupo de Teor&iacute;a y M&eacute;todos Formales incluye la programaci&oacute;n funcional, el an&aacute;lisis formal de lenguajes de programaci&oacute;n, Fork algebras y m&eacute;todos formales en la ingenier&iacute;a de software. Este grupo estudia como la especificaci&oacute;n formal puede complementar el desarrollo de software y como puede ayudar a clarificar la sem&aacute;ntica de las notaciones (por ejemplo para lenguajes de an&aacute;lisis y dise&ntilde;o, lenguajes de programaci&oacute;n) y de los conceptos.<br>
        <br>
        <br>
        <span class="titulo_negro">Ingenier&iacute;a Web </span><br>
        <br>
        En esta &aacute;rea nos centramos en los enfoques de dise&ntilde;o y modelado para la construcci&oacute;n de aplicaciones Web en forma modular. Los proyectos de este &aacute;rea son una evoluci&oacute;n de nuestros trabajos previos en el m&eacute;todo de dise&ntilde;o de hipermedia orientada a objetos OOHDM. Actualmente se est&aacute;n conduciendo investigaciones de campo relacionadas con aplicaciones Web m&oacute;viles (tales como hipermedia f&iacute;sica, software sensible al contexto, etc).<br>
        <br>
        <br>
        <span class="titulo_negro">SIG y computaci&oacute;n m&oacute;vil </span><br>
        <br>
    Este grupo de investigación enfrenta los desaf&iacute;os de la construcci&oacute;n de aplicaciones geogr&aacute;ficas, perticularmente las m&oacute;viles, desde la perspectiva de la ingenier&iacute;a de software. El trabajo se enfoca en los diferentes enfoques arquitecturales necesarios, con especial &eacute;nfasis en la calidad de dichas aplicaciones.</p>    </td>
  </tr>
  <tr>
    <td height="97" valign="top" class="texto_negro"><!--DWLayoutEmptyCell-->&nbsp;</td>
  </tr>
</table>
</body>
</html>

<!-- Localized -->